knieriem/tinygo-stm32-svd/svd/stm32h573.svd
        <register>
          <name>MPCWM1AR</name>
          <displayName>MPCWM1AR</displayName>
          <description>GTZC1 TZSC memory 1 sub-region A watermark register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SUBA_START</name>
              <description>Start of sub-region A in region x
This field defines the address offset of the sub-region A, to be multiplied by the granularity defined in Table30, versus the start of the region x.
External memories that are watermark controlled, start fully non-secure at reset when TZEN=0xC3. When TZEN=0xB4, external memories start fully secure (inverted reset value).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUBA_LENGTH</name>
              <description>Length of sub-region A in region x
This field defines the length of the sub-region A, to be multiplied by the granularity defined in Table30.
When SUBA_START + SUBA_LENGTH is higher than the maximum size allowed for the
memory, a saturation of SUBA_LENGTH is applied automatically.
If SUBA_LENGTH = 0, the sub-region A is disabled.(SREN bit in GTZC1_TZSC_MPCMWxACFGR is cleared).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPCWM1BCFGR</name>
          <displayName>MPCWM1BCFGR</displayName>
          <description>GTZC1 TZSC memory 1 sub-region B watermark configuration	register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SREN</name>
              <description>Sub-region B enable
Note: External memories that are watermark controlled start fully non-secure/unprivileged at reset when TZEN = 0xC3. When TZEN = 0xB4, external memories start fully secure/fully privileged (inverted reset-value).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRLOCK</name>
              <description>Sub-region B lock
This bit, once set, can be cleared only by a system reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure sub-region B of base region x
This bit is taken into account only if SREN is set.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV</name>
              <description>Privileged sub-region B of base region x
This bit is taken into account only if SREN is set.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPCWM1BR</name>
          <displayName>MPCWM1BR</displayName>
          <description>GTZC1 TZSC memory 1 sub-region B watermark register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SUBB_START</name>
              <description>Start of sub-region B in region x
This field defines the address offset of the sub-region B, to be multiplied by the granularity defined in Table30, versus the start of the region x.
External memories that are watermark controlled, start fully non-secure at reset when TZEN=0xC3. When TZEN=0xB4, external memories start fully secure (inverted reset value).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUBB_LENGTH</name>
              <description>Length of sub-region B in region x
This field defines the length of the sub-region B, to be multiplied by the granularity defined in Table30.
When SUBB_START + SUBB_LENGTH is higher than the maximum size allowed for the
memory, a saturation of SUBB_LENGTH is applied automatically.
If SUBB_LENGTH = 0, the sub-region B is disabled.(SREN bit in GTZC1_TZSC_MPCMWxBCFGR is cleared).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPCWM2ACFGR</name>
          <displayName>MPCWM2ACFGR</displayName>
          <description>GTZC1 TZSC memory 2 sub-region A watermark configuration	register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SREN</name>
              <description>Sub-region z enable
Note: External memories that are watermark controlled start fully non-secure/unprivileged at reset when TZEN = 0xC3. When TZEN = 0xB4, external memories start fully secure/fully privileged (inverted reset-value).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRLOCK</name>
              <description>Sub-region A lock
This bit, once set, can be cleared only by a system reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure sub-region A of base region x
This bit is taken into account only if SREN is set.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV</name>
              <description>Privileged sub-region A of base region x
This bit is taken into account only if SREN is set.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPCWM2AR</name>
          <displayName>MPCWM2AR</displayName>
          <description>GTZC1 TZSC memory 2 sub-region A watermark register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SUBA_START</name>
              <description>Start of sub-region A in region x
This field defines the address offset of the sub-region A, to be multiplied by the granularity defined in Table30, versus the start of the region x.
External memories that are watermark controlled, start fully non-secure at reset when TZEN=0xC3. When TZEN=0xB4, external memories start fully secure (inverted reset value).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUBA_LENGTH</name>
              <description>Length of sub-region A in region x
This field defines the length of the sub-region A, to be multiplied by the granularity defined in Table30.
When SUBA_START + SUBA_LENGTH is higher than the maximum size allowed for the
memory, a saturation of SUBA_LENGTH is applied automatically.
If SUBA_LENGTH = 0, the sub-region A is disabled.(SREN bit in GTZC1_TZSC_MPCMWxACFGR is cleared).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPCWM2BCFGR</name>
          <displayName>MPCWM2BCFGR</displayName>
          <description>GTZC1 TZSC memory 2 sub-region B watermark configuration	register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SREN</name>
              <description>Sub-region B enable
Note: External memories that are watermark controlled start fully non-secure/unprivileged at reset when TZEN = 0xC3. When TZEN = 0xB4, external memories start fully secure/fully privileged (inverted reset-value).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRLOCK</name>
              <description>Sub-region B lock
This bit, once set, can be cleared only by a system reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure sub-region B of base region x
This bit is taken into account only if SREN is set.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV</name>
              <description>Privileged sub-region B of base region x
This bit is taken into account only if SREN is set.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPCWM2BR</name>
          <displayName>MPCWM2BR</displayName>
          <description>GTZC1 TZSC memory 2 sub-region B watermark register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SUBB_START</name>
              <description>Start of sub-region B in region x
This field defines the address offset of the sub-region B, to be multiplied by the granularity defined in Table30, versus the start of the region x.
External memories that are watermark controlled, start fully non-secure at reset when TZEN=0xC3. When TZEN=0xB4, external memories start fully secure (inverted reset value).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUBB_LENGTH</name>
              <description>Length of sub-region B in region x
This field defines the length of the sub-region B, to be multiplied by the granularity defined in Table30.
When SUBB_START + SUBB_LENGTH is higher than the maximum size allowed for the
memory, a saturation of SUBB_LENGTH is applied automatically.
If SUBB_LENGTH = 0, the sub-region B is disabled.(SREN bit in GTZC1_TZSC_MPCMWxBCFGR is cleared).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPCWM3ACFGR</name>
          <displayName>MPCWM3ACFGR</displayName>
          <description>GTZC1 TZSC memory 3 sub-region A watermark configuration	register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SREN</name>
              <description>Sub-region z enable
Note: External memories that are watermark controlled start fully non-secure/unprivileged at reset when TZEN = 0xC3. When TZEN = 0xB4, external memories start fully secure/fully privileged (inverted reset-value).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRLOCK</name>
              <description>Sub-region A lock
This bit, once set, can be cleared only by a system reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure sub-region A of base region x
This bit is taken into account only if SREN is set.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV</name>
              <description>Privileged sub-region A of base region x
This bit is taken into account only if SREN is set.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPCWM3AR</name>
          <displayName>MPCWM3AR</displayName>
          <description>GTZC1 TZSC memory 3 sub-region A watermark register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SUBA_START</name>
              <description>Start of sub-region A in region x
This field defines the address offset of the sub-region A, to be multiplied by the granularity defined in Table30, versus the start of the region x.
External memories that are watermark controlled, start fully non-secure at reset when TZEN=0xC3. When TZEN=0xB4, external memories start fully secure (inverted reset value).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUBA_LENGTH</name>
              <description>Length of sub-region A in region x
This field defines the length of the sub-region A, to be multiplied by the granularity defined in Table30.
When SUBA_START + SUBA_LENGTH is higher than the maximum size allowed for the
memory, a saturation of SUBA_LENGTH is applied automatically.
If SUBA_LENGTH = 0, the sub-region A is disabled.(SREN bit in GTZC1_TZSC_MPCMWxACFGR is cleared).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPCWM3BCFGR</name>
          <displayName>MPCWM3BCFGR</displayName>
          <description>GTZC1 TZSC memory 3 sub-region B watermark configuration	register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SREN</name>
              <description>Sub-region B enable
Note: External memories that are watermark controlled start fully non-secure/unprivileged at reset when TZEN = 0xC3. When TZEN = 0xB4, external memories start fully secure/fully privileged (inverted reset-value).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRLOCK</name>
              <description>Sub-region B lock
This bit, once set, can be cleared only by a system reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure sub-region B of base region x
This bit is taken into account only if SREN is set.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV</name>
              <description>Privileged sub-region B of base region x
This bit is taken into account only if SREN is set.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPCWM3BR</name>
          <displayName>MPCWM3BR</displayName>
          <description>GTZC1 TZSC memory 3 sub-region B watermark register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SUBB_START</name>
              <description>Start of sub-region B in region x
This field defines the address offset of the sub-region B, to be multiplied by the granularity defined in Table30, versus the start of the region x.
External memories that are watermark controlled, start fully non-secure at reset when TZEN=0xC3. When TZEN=0xB4, external memories start fully secure (inverted reset value).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUBB_LENGTH</name>
              <description>Length of sub-region B in region x
This field defines the length of the sub-region B, to be multiplied by the granularity defined in Table30.
When SUBB_START + SUBB_LENGTH is higher than the maximum size allowed for the
memory, a saturation of SUBB_LENGTH is applied automatically.
If SUBB_LENGTH = 0, the sub-region B is disabled.(SREN bit in GTZC1_TZSC_MPCMWxBCFGR is cleared).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPCWM4ACFGR</name>
          <displayName>MPCWM4ACFGR</displayName>
          <description>GTZC1 TZSC memory 4 sub-region A watermark configuration	register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SREN</name>
              <description>Sub-region z enable
Note: External memories that are watermark controlled start fully non-secure/unprivileged at reset when TZEN = 0xC3. When TZEN = 0xB4, external memories start fully secure/fully privileged (inverted reset-value).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRLOCK</name>
              <description>Sub-region A lock
This bit, once set, can be cleared only by a system reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure sub-region A of base region x
This bit is taken into account only if SREN is set.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIV</name>
              <description>Privileged sub-region A of base region x
This bit is taken into account only if SREN is set.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPCWM4AR</name>
          <displayName>MPCWM4AR</displayName>
          <description>GTZC1 TZSC memory 4 sub-region A watermark register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SUBA_START</name>
              <description>Start of sub-region A in region x
This field defines the address offset of the sub-region A, to be multiplied by the granularity defined in Table30, versus the start of the region x.
External memories that are watermark controlled, start fully non-secure at reset when TZEN=0xC3. When TZEN=0xB4, external memories start fully secure (inverted reset value).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUBA_LENGTH</name>
              <description>Length of sub-region A in region x
This field defines the length of the sub-region A, to be multiplied by the granularity defined in Table30.
When SUBA_START + SUBA_LENGTH is higher than the maximum size allowed for the
memory, a saturation of SUBA_LENGTH is applied automatically.
If SUBA_LENGTH = 0, the sub-region A is disabled.(SREN bit in GTZC1_TZSC_MPCMWxACFGR is cleared).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
