knieriem/tinygo-stm32-svd/svd/stm32h573.svd
          <register>
            <name>TR2</name>
            <displayName>C0TR2</displayName>
            <description>GPDMA channel 0 transfer register 2</description>
            <addressOffset>0x44</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>REQSEL</name>
                <description>GPDMA hardware request selection
These bits are ignored if channel x is activated (GPDMA_CxCR.EN asserted) with SWREQ = 1 (software request for a memory-to-memory transfer). Else, the selected hardware request is internally taken into account as per .
The user must not assign a same input hardware request (same REQSEL[7:0] value) to different active GPDMA channels (GPDMA_CxCR.EN = 1 and GPDMA_CxTR2.SWREQ = 0 for these channels). GPDMA is not intended to hardware support the case of simultaneous enabled channels incorrectly configured with a same hardware peripheral request signal, and there is no user setting error reporting.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <name>REQSEL</name>
                  <enumeratedValue>
                    <name>ADC1_DMA</name>
                    <description>adc1_dma selected</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DAC1_CH1_DMA</name>
                    <description>dac1_ch1_dma selected</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DAC1_CH2_DMA</name>
                    <description>dac1_ch2_dma selected</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM6_UPD_DMA</name>
                    <description>tim6_upd_dma selected</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM7_UPD_DMA</name>
                    <description>tim7_upd_dma selected</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPI1_RX_DMA</name>
                    <description>spi1_rx_dma selected</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPI1_TX_DMA</name>
                    <description>spi1_tx_dma selected</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPI2_RX_DMA</name>
                    <description>spi2_rx_dma selected</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPI2_TX_DMA</name>
                    <description>spi2_tx_dma selected</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPI3_RX_DMA</name>
                    <description>spi3_rx_dma selected</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPI3_TX_DMA</name>
                    <description>spi3_tx_dma selected</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I2C1_RX_DMA</name>
                    <description>i2c1_rx_dma selected</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I2C1_TX_DMA</name>
                    <description>i2c1_tx_dma selected</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I2C2_RX_DMA</name>
                    <description>i2c2_rx_dma selected</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I2C2_TX_DMA</name>
                    <description>i2c2_tx_dma selected</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I2C3_RX_DMA</name>
                    <description>i2c3_rx_dma selected</description>
                    <value>18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I2C3_TX_DMA</name>
                    <description>i2c3_tx_dma selected</description>
                    <value>19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USART1_RX_DMA</name>
                    <description>usart1_rx_dma selected</description>
                    <value>21</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USART1_TX_DMA</name>
                    <description>usart1_tx_dma selected</description>
                    <value>22</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USART2_RX_DMA</name>
                    <description>usart2_rx_dma selected</description>
                    <value>23</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USART2_TX_DMA</name>
                    <description>usart2_tx_dma selected</description>
                    <value>24</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USART3_RX_DMA</name>
                    <description>usart3_rx_dma selected</description>
                    <value>25</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USART3_TX_DMA</name>
                    <description>usart3_tx_dma selected</description>
                    <value>26</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART4_RX_DMA</name>
                    <description>uart4_rx_dma selected</description>
                    <value>27</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART4_TX_DMA</name>
                    <description>uart4_tx_dma selected</description>
                    <value>28</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART5_RX_DMA</name>
                    <description>uart5_rx_dma selected</description>
                    <value>29</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART5_TX_DMA</name>
                    <description>uart5_tx_dma selected</description>
                    <value>30</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USART6_RX_DMA</name>
                    <description>usart6_rx_dma selected</description>
                    <value>31</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USART6_TX_DMA</name>
                    <description>usart6_tx_dma selected</description>
                    <value>32</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART7_RX_DMA</name>
                    <description>uart7_rx_dma selected</description>
                    <value>33</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART7_TX_DMA</name>
                    <description>uart7_tx_dma selected</description>
                    <value>34</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART8_RX_DMA</name>
                    <description>uart8_rx_dma selected</description>
                    <value>35</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART8_TX_DMA</name>
                    <description>uart8_tx_dma selected</description>
                    <value>36</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART9_RX_DMA</name>
                    <description>uart9_rx_dma selected</description>
                    <value>37</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART9_TX_DMA</name>
                    <description>uart9_tx_dma selected</description>
                    <value>38</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART10_RX_DMA</name>
                    <description>uart10_rx_dma selected</description>
                    <value>39</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART10_TX_DMA</name>
                    <description>uart10_tx_dma selected</description>
                    <value>40</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART11_RX_DMA</name>
                    <description>uart11_rx_dma selected</description>
                    <value>41</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART11_TX_DMA</name>
                    <description>uart11_tx_dma selected</description>
                    <value>42</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART12_RX_DMA</name>
                    <description>uart12_rx_dma selected</description>
                    <value>43</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART12_TX_DMA</name>
                    <description>uart12_tx_dma selected</description>
                    <value>44</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPUART1_RX_DMA</name>
                    <description>lpuart1_rx_dma selected</description>
                    <value>45</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPUART1_TX_DMA</name>
                    <description>lpuart1_tx_dma selected</description>
                    <value>46</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPI4_RX_DMA</name>
                    <description>spi4_rx_dma selected</description>
                    <value>47</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPI4_TX_DMA</name>
                    <description>spi4_tx_dma selected</description>
                    <value>48</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPI5_RX_DMA</name>
                    <description>spi5_rx_dma selected</description>
                    <value>49</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPI5_TX_DMA</name>
                    <description>spi5_tx_dma selected</description>
                    <value>50</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPI6_RX_DMA</name>
                    <description>spi6_rx_dma selected</description>
                    <value>51</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPI6_TX_DMA</name>
                    <description>spi6_tx_dma selected</description>
                    <value>52</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SAI1_A_DMA</name>
                    <description>sai1_a_dma selected</description>
                    <value>53</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SAI1_B_DMA</name>
                    <description>sai1_b_dma selected</description>
                    <value>54</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SAI2_A_DMA</name>
                    <description>sai2_a_dma selected</description>
                    <value>55</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SAI2_B_DMA</name>
                    <description>sai2_b_dma selected</description>
                    <value>56</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OSPI1_DMA</name>
                    <description>ospi1_dma selected</description>
                    <value>57</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM1_CC1_DMA</name>
                    <description>tim1_cc1_dma selected</description>
                    <value>58</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM1_CC2_DMA</name>
                    <description>tim1_cc2_dma selected</description>
                    <value>59</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM1_CC3_DMA</name>
                    <description>tim1_cc3_dma selected</description>
                    <value>60</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM1_CC4_DMA</name>
                    <description>tim1_cc4_dma selected</description>
                    <value>61</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM1_UPD_DMA</name>
                    <description>tim1_upd_dma selected</description>
                    <value>62</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM1_TRG_DMA</name>
                    <description>tim1_trg_dma selected</description>
                    <value>63</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM1_COM_DMA</name>
                    <description>tim1_com_dma selected</description>
                    <value>64</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM8_CC1_DMA</name>
                    <description>tim8_cc1_dma selected</description>
                    <value>65</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM8_CC2_DMA</name>
                    <description>tim8_cc2_dma selected</description>
                    <value>66</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM8_CC3_DMA</name>
                    <description>tim8_cc3_dma selected</description>
                    <value>67</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM8_CC4_DMA</name>
                    <description>tim8_cc4_dma selected</description>
                    <value>68</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM8_UPD_DMA</name>
                    <description>tim8_upd_dma selected</description>
                    <value>69</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM8_TIG_DMA</name>
                    <description>tim8_tig_dma selected</description>
                    <value>70</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM8_COM_DMA</name>
                    <description>tim8_com_dma selected</description>
                    <value>71</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM2_CC1_DMA</name>
                    <description>tim2_cc1_dma selected</description>
                    <value>72</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM2_CC2_DMA</name>
                    <description>tim2_cc2_dma selected</description>
                    <value>73</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM2_CC3_DMA</name>
                    <description>tim2_cc3_dma selected</description>
                    <value>74</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM2_CC4_DMA</name>
                    <description>tim2_cc4_dma selected</description>
                    <value>75</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM2_UPD_DMA</name>
                    <description>tim2_upd_dma selected</description>
                    <value>76</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM3_CC1_DMA</name>
                    <description>tim3_cc1_dma selected</description>
                    <value>77</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM3_CC2_DMA</name>
                    <description>tim3_cc2_dma selected</description>
                    <value>78</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM3_CC3_DMA</name>
                    <description>tim3_cc3_dma selected</description>
                    <value>79</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM3_CC4_DMA</name>
                    <description>tim3_cc4_dma selected</description>
                    <value>80</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM3_UPD_DMA</name>
                    <description>tim3_upd_dma selected</description>
                    <value>81</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM3_TRG_DMA</name>
                    <description>tim3_trg_dma selected</description>
                    <value>82</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM4_CC1_DMA</name>
                    <description>tim4_cc1_dma selected</description>
                    <value>83</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM4_CC2_DMA</name>
                    <description>tim4_cc2_dma selected</description>
                    <value>84</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM4_CC3_DMA</name>
                    <description>tim4_cc3_dma selected</description>
                    <value>85</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM4_CC4_DMA</name>
                    <description>tim4_cc4_dma selected</description>
                    <value>86</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM4_UPD_DMA</name>
                    <description>tim4_upd_dma selected</description>
                    <value>87</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM5_CC1_DMA</name>
                    <description>tim5_cc1_dma selected</description>
                    <value>88</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM5_CC2_DMA</name>
                    <description>tim5_cc2_dma selected</description>
                    <value>89</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM5_CC3_DMA</name>
                    <description>tim5_cc3_dma selected</description>
                    <value>90</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM5_CC4_DMA</name>
                    <description>tim5_cc4_dma selected</description>
                    <value>91</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM5_UPD_DMA</name>
                    <description>tim5_upd_dma selected</description>
                    <value>92</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM5_TRG_DMA</name>
                    <description>tim5_trg_dma selected</description>
                    <value>93</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM15_CC1_DMA</name>
                    <description>tim15_cc1_dma selected</description>
                    <value>94</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM15_UPD_DMA</name>
                    <description>tim15_upd_dma selected</description>
                    <value>95</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM15_TRG_DMA</name>
                    <description>tim15_trg_dma selected</description>
                    <value>96</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM15_COM_DMA</name>
                    <description>tim15_com_dma selected</description>
                    <value>97</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM16_CC1_DMA</name>
                    <description>tim16_cc1_dma selected</description>
                    <value>98</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM16_UPD_DMA</name>
                    <description>tim16_upd_dma selected</description>
                    <value>99</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM17_CC1_DMA</name>
                    <description>tim17_cc1_dma selected</description>
                    <value>100</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIM17_UPD_DMA</name>
                    <description>tim17_upd_dma selected</description>
                    <value>101</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM1_IC1_DMA</name>
                    <description>lptim1_ic1_dma selected</description>
                    <value>102</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM1_IC2_DMA</name>
                    <description>lptim1_ic2_dma selected</description>
                    <value>103</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM1_UE_DMA</name>
