knieriem/tinygo-stm32-svd/svd/stm32h573.svd
                    <description>lptim1_ue_dma selected</description>
                    <value>104</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM2_IC1_DMA</name>
                    <description>lptim2_ic1_dma selected</description>
                    <value>105</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM2_IC2_DMA</name>
                    <description>lptim2_ic2_dma selected</description>
                    <value>106</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM2_UE_DMA</name>
                    <description>lptim2_ue_dma selected</description>
                    <value>107</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DCMI_PSSI_DMA</name>
                    <description>dcmi_dma or pssi_dma(1) selected</description>
                    <value>108</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AES_OUT_DMA</name>
                    <description>aes_out_dma selected</description>
                    <value>109</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AES_IN_DMA</name>
                    <description>aes_in_dma selected</description>
                    <value>110</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HASH_IN_DMA</name>
                    <description>hash_in_dma selected</description>
                    <value>111</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UCPD1_RX_DMA</name>
                    <description>ucpd1_rx_dma selected</description>
                    <value>112</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UCPD1_TX_DMA</name>
                    <description>ucpd1_tx_dma selected</description>
                    <value>113</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CORDIC_READ_DMA</name>
                    <description>cordic_read_dma selected</description>
                    <value>114</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CORDIC_WRITE_DMA</name>
                    <description>cordic_write_dma selected</description>
                    <value>115</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FMAC_READ_DMA</name>
                    <description>fmac_read_dma selected</description>
                    <value>116</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FMAC_WRITE_DMA</name>
                    <description>fmac_write_dma selected</description>
                    <value>117</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SAES_OUT_DMA</name>
                    <description>saes_out_dma selected</description>
                    <value>118</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SAES_IN_DMA</name>
                    <description>saes_in_dma selected</description>
                    <value>119</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I3C1_RX_DMA</name>
                    <description>i3c1_rx_dma selected</description>
                    <value>120</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I3C1_TX_DMA</name>
                    <description>i3c1_tx_dma selected</description>
                    <value>121</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I3C1_TC_DMA</name>
                    <description>i3c1_tc_dma selected</description>
                    <value>122</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I3C1_RS_DMA</name>
                    <description>i3c1_rs_dma selected</description>
                    <value>123</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I2C4_RX_DMA</name>
                    <description>i2c4_rx_dma selected</description>
                    <value>124</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I2C4_TX_DMA</name>
                    <description>i2c4_tx_dma selected</description>
                    <value>125</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM3_IC1_DMA</name>
                    <description>lptim3_ic1_dma selected</description>
                    <value>127</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM3_IC2_DMA</name>
                    <description>lptim3_ic2_dma selected</description>
                    <value>128</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM3_UE_DMA</name>
                    <description>lptim3_ue_dma selected</description>
                    <value>129</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM5_IC1_DMA</name>
                    <description>lptim5_ic1_dma selected</description>
                    <value>130</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM5_IC2_DMA</name>
                    <description>lptim5_ic2_dma selected</description>
                    <value>131</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM5_UE_DMA</name>
                    <description>lptim5_ue_dma selected</description>
                    <value>132</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM6_IC1_DMA</name>
                    <description>lptim6_ic1_dma selected</description>
                    <value>133</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM6_IC2_DMA</name>
                    <description>lptim6_ic2_dma selected</description>
                    <value>134</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM6_UE_DMA</name>
                    <description>lptim6_ue_dma selected</description>
                    <value>135</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I3C2_RX</name>
                    <description>i3c2_rx selected</description>
                    <value>136</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I3C2_TX</name>
                    <description>i3c2_tx selected</description>
                    <value>137</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I3C2_TC</name>
                    <description>i3c2_tc selected</description>
                    <value>138</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I3C2_RS</name>
                    <description>i3c2_rs selected</description>
                    <value>139</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SWREQ</name>
                <description>software request
This bit is internally taken into account when GPDMA_CxCR.EN is asserted.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <name>SWREQ</name>
                  <enumeratedValue>
                    <name>Hardware</name>
                    <description>No software request. The selected hardware request REQSEL[7:0] is taken into account</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Software</name>
                    <description>Software request for memory-to-memory transfer</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DREQ</name>
                <description>destination hardware request
This bit is ignored if channel x is activated (GPDMA_CxCR.EN asserted) with SWREQ = 1 (software request for a memory-to-memory transfer). Else:
Note: If the channel x is activated (GPDMA_CxCR.EN is asserted) with SWREQ = 0 and PFREQ = 1 (peripheral hardware request with peripheral flow-control mode), any software assertion to this DREQ bit is ignored: in peripheral flow-control mode, only a peripheral-to-memory transfer is supported.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <name>DREQ</name>
                  <enumeratedValue>
                    <name>Source</name>
                    <description>Selected hardware request driven by a source peripheral</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Destination</name>
                    <description>Selected hardware request driven by a destination peripheral</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BREQ</name>
                <description>Block hardware request
If the channel x is activated (GPDMA_CxCR.EN asserted) with SWREQ = 1 (software request for a memory-to-memory transfer), this bit is ignored. Else:</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <name>BREQ</name>
                  <enumeratedValue>
                    <name>Burst</name>
                    <description>The selected hardware request is driven by a peripheral with a hardware request/acknowledge protocol at a burst level</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Block</name>
                    <description>The selected hardware request is driven by a peripheral with a hardware request/acknowledge protocol at a block level</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PFREQ</name>
                <description>Hardware request in peripheral flow control mode
Important: If a given channel x is not implemented with this feature, this bit is reserved and PFREQ is not present (see  for the list of the implemented channels with this feature.
If the channel x is activated (GPDMA_CxCR.EN asserted) with SWREQ = 1 (software request for a memory-to-memory transfer), this bit is ignored. Else:
Note: In peripheral flow control mode, there are the following restrictions:
- no 2D/repeated block support (GPDMA_CxBR1.BRC[10:0] must be set to 0 if present)
- the peripheral must be set as the source of the transfer (DREQ = 0).
- data packing to a wider destination width is not supported (if destination width   source data width, GPDMA_CxTR1.PAM[1] must be set to 0).
- GPDMA_CxBR1.BNDT[15:0] must be programmed as a multiple of the source (peripheral) burst size.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <name>PFREQ</name>
                  <enumeratedValue>
                    <name>GpdmaControlMode</name>
                    <description>The selected hardware request is driven by a peripheral with a hardware request/acknowledge protocol in GPDMA control mode</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PeripheralControlMode</name>
                    <description>The selected hardware request is driven by a peripheral with a hardware request/acknowledge protocol in peripheral control mode.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRIGM</name>
                <description>trigger mode
These bits define the transfer granularity for its conditioning by the trigger.
If the channel x is enabled (GPDMA_CxCR.EN asserted) with TRIGPOL[1:0] = 00 or 11, these TRIGM[1:0] bits are ignored.
Else, a GPDMA transfer is conditioned by at least one trigger hit:
first burst read of a 2D/repeated block transfer is conditioned by one hit trigger.
If the peripheral is programmed as a source (DREQ = 0) of the LLI data transfer, each programmed burst read is conditioned.
If the peripheral is programmed as a destination (DREQ = 1) of the LLI data transfer, each programmed burst write is conditioned. The first memory burst read of a (possibly 2D/repeated) block, also named as the first ready FIFO-based source burst, is gated by the occurrence of both the hardware request and the first trigger hit.
The GPDMA monitoring of a trigger for channel x is started when the channel is enabled/loaded with a new active trigger configuration: rising or falling edge on a selected trigger (TRIGPOL[1:0] = 01 or respectively TRIGPOL[1:0] = 10).
The monitoring of this trigger is kept active during the triggered and uncompleted (data or link) transfer; and if a new trigger is detected then, this hit is internally memorized to grant the next transfer, as long as the defined rising or falling edge is not modified, and the TRIGSEL[5:0] is not modified, and the channel is enabled.
Transferring a next LLIn+1 that updates the GPDMA_CxTR2 with a new value for any of TRIGSEL[5:0] or TRIGPOL[1:0], resets the monitoring, trashing the memorized hit of the formerly defined LLIn trigger.
After a first new trigger hitn+1 is memorized, if another second trigger hitn+2 is detected and if the hitn triggered transfer is still not completed, hitn+2 is lost and not memorized.memorized. A trigger overrun flag is reported (GPDMA_CxSR.TOF =1 ), and an interrupt is generated if enabled (GPDMA_CxCR.TOIE = 1). The channel is not automatically disabled by hardware due to a trigger overrun.
Note: When the source block size is not a multiple of the source burst size and is a multiple of the source data width, then the last programmed source burst is not completed and is internally shorten to match the block size. In this case, if TRIGM[1:0] = 11 and (SWREQ =1  or (SWREQ = 0 and DREQ =0 )), the shortened burst transfer (by singles or/and by bursts of lower length) is conditioned once by the trigger.
When the programmed destination burst is internally shortened by singles or/and by bursts of lower length (versus FIFO size, versus block size, 1-Kbyte boundary address crossing): if the trigger is conditioning the programmed destination burst (if TRIGM[1:0] = 11 and SWREQ = 0 and DREQ = 1), this shortened destination burst transfer is conditioned once by the trigger.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <name>TRIGM</name>
                  <enumeratedValue>
                    <name>BlockLevel</name>
                    <description>At block level:  the first burst read of each block transfer is conditioned by one hit trigger</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LinkLevel</name>
                    <description>At link level:  a LLI link transfer is conditioned by one hit trigger</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ProgrammedBurstLevel</name>
                    <description>At programmed burst level: programmed burst read is conditioned by one hit trigger. </description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TRIGSEL</name>
                <description>trigger event input selection
These bits select the trigger event input of the GPDMA transfer (as per ), with an active trigger event if TRIGPOL[1:0] different  00.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <name>TRIGSEL</name>
                  <enumeratedValue>
                    <name>EXTI0</name>
                    <description>exti0 is trigger input</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EXTI1</name>
                    <description>exti1 is trigger input</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EXTI2</name>
                    <description>exti2 is trigger input</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EXTI3</name>
                    <description>exti3 is trigger input</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EXTI4</name>
                    <description>exti4 is trigger input</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EXTI5</name>
                    <description>exti5 is trigger input</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EXTI6</name>
                    <description>exti6 is trigger input</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EXTI7</name>
                    <description>exti7 is trigger input</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TAMP_TRG1</name>
                    <description>tamp_trg1 is trigger input</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TAMP_TRG2</name>
                    <description>tamp_trg2 is trigger input</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM1_CH1</name>
                    <description>lptim1_ch1 is trigger input</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM1_CH2</name>
                    <description>lptim1_ch2 is trigger input</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM2_CH1</name>
                    <description>lptim2_ch1 is trigger input</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LPTIM2_CH2</name>
                    <description>lptim2_ch2 is trigger input</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RTC_ALRA_TRG</name>
                    <description>rtc_alra_trg is trigger input</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RTC_ALRB_TRG</name>
                    <description>rtc_alrb_trg is trigger input</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RTC_WUT_TRG</name>
                    <description>rtc_wut_trg is trigger input</description>
                    <value>17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GPDMA1_CH0_TC</name>
                    <description>gpdma1_ch0_tc is trigger input</description>
                    <value>18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GPDMA1_CH1_TC</name>
                    <description>gpdma1_ch1_tc is trigger input</description>
                    <value>19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GPDMA1_CH2_TC</name>
                    <description>gpdma1_ch2_tc is trigger input</description>
                    <value>20</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GPDMA1_CH3_TC</name>
                    <description>gpdma1_ch3_tc is trigger input</description>
                    <value>21</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GPDMA1_CH4_TC</name>
                    <description>gpdma1_ch4_tc is trigger input</description>
                    <value>22</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GPDMA1_CH5_TC</name>
                    <description>gpdma1_ch5_tc is trigger input</description>
                    <value>23</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GPDMA1_CH6_TC</name>
                    <description>gpdma1_ch6_tc is trigger input</description>
                    <value>24</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GPDMA1_CH7_TC</name>
                    <description>gpdma1_ch7_tc is trigger input</description>
                    <value>25</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GPDMA2_CH0_TC</name>
                    <description>gpdma2_ch0_tc is trigger input</description>
                    <value>26</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GPDMA2_CH1_TC</name>
                    <description>gpdma2_ch1_tc is trigger input</description>
                    <value>27</value>
                  </enumeratedValue>
                  <enumeratedValue>
