knieriem/tinygo-stm32-svd/svd/stm32h573.svd
          <register derivedFrom="GPDMA1.CH%s.SR">
            <name>SR</name>
            <displayName>C6SR</displayName>
            <description>GPDMA channel 6 status register</description>
            <addressOffset>0x10</addressOffset>
          </register>
          <register derivedFrom="GPDMA1.CH%s.CR">
            <name>CR</name>
            <displayName>C6CR</displayName>
            <description>GPDMA channel 6 control register</description>
            <addressOffset>0x14</addressOffset>
          </register>
          <register derivedFrom="GPDMA1.CH%s.TR1">
            <name>TR1</name>
            <displayName>C6TR1</displayName>
            <description>GPDMA channel 6 transfer register 1</description>
            <addressOffset>0x40</addressOffset>
          </register>
          <register derivedFrom="GPDMA1.CH%s.TR2">
            <name>TR2</name>
            <displayName>C6TR2</displayName>
            <description>GPDMA channel 6 transfer register 2</description>
            <addressOffset>0x44</addressOffset>
          </register>
          <register>
            <name>BR1</name>
            <displayName>C6BR1</displayName>
            <description>GPDMA channel 6 alternate block register 1</description>
            <addressOffset>0x48</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field derivedFrom="GPDMA1.CH%s.BR1.BNDT">
                <name>BNDT</name>
                <description>block number of data bytes to transfer from the source
Block size transferred from the source. When the channel is enabled, this field becomes read-only and is decremented, indicating the remaining number of data items in the current source block to be transferred. BNDT[15:0] is programmed in number of bytes, maximum source block size is 64 Kbytes -1.
Once the last data transfer is completed (BNDT[15:0] = 0):
- if GPDMA_CxLLR.UB1 = 1, this field is updated by the LLI in the memory.
- if GPDMA_CxLLR.UB1 = 0 and if there is at least one not null Uxx update bit, this field is internally restored to the programmed value.
- if all GPDMA_CxLLR.Uxx = 0 and if GPDMA_CxLLR.LA[15:0] different  0, this field is internally restored to the programmed value (infinite/continuous last LLI).
- if GPDMA_CxLLR = 0, this field is kept as zero following the last LLI data transfer.
Note: A non-null source block size must be a multiple of the source data width (BNDT[2:0] versus GPDMA_CxTR1.SDW_LOG2[1:0]). Else a user setting error is reported and no transfer is issued.
When configured in packing mode (GPDMA_CxTR1.PAM[1]=1 and destination data width different from source data width), a non-null source block size must be a multiple of the destination data width (BNDT[2:0] versus GPDMA_CxTR1.DDW_LOG2[1:0]). Else a user setting error is reported and no transfer is issued.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BRC</name>
                <description>Block repeat counter
This field contains the number of repetitions of the current block (0 to 2047).
When the channel is enabled, this field becomes read-only. After decrements, this field indicates the remaining number of blocks, excluding the current one. This counter is hardware decremented for each completed block transfer.
Once the last block transfer is completed (BRC[10:0] = BNDT[15:0] = 0):
If GPDMA_CxLLR.UB1 = 1, all GPDMA_CxBR1 fields are updated by the next LLI in the memory.
If GPDMA_CxLLR.UB1 = 0 and if there is at least one not null Uxx update bit, this field is internally restored to the programmed value.
if all GPDMA_CxLLR.Uxx = 0 and if GPDMA_CxLLR.LA[15:0] different  0, this field is internally restored to the programmed value (infinite/continuous last LLI).
if GPDMA_CxLLR = 0, this field is kept as zero following the last LLI and data transfer.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0</minimum>
                    <maximum>2047</maximum>
                  </range>
                </writeConstraint>
              </field>
              <field>
                <name>SDEC</name>
                <description>source address decrement</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <name>SDEC</name>
                  <enumeratedValue>
                    <name>Increment</name>
                    <description>Source address incremented</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Decrement</name>
                    <description>Source address decremented</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DDEC</name>
                <description>destination address decrement</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <name>DDEC</name>
                  <enumeratedValue>
                    <name>Increment</name>
                    <description>Destination address incremented</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Decrement</name>
                    <description>Destination address decremented</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BRSDEC</name>
                <description>Block repeat source address decrement
Note: On top of this increment/decrement (depending on BRSDEC), GPDMA_CxSAR is in the same time also updated by the increment/decrement (depending on SDEC) of the GPDMA_CxTR3.SAO value, as it is done after any programmed burst transfer.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <name>BRSDEC</name>
                  <enumeratedValue>
                    <name>Increment</name>
                    <description>Block repeat source address incremented</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Decrement</name>
                    <description>Block repeat source address decremented</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BRDDEC</name>
                <description>Block repeat destination address decrement
Note: On top of this increment/decrement (depending on BRDDEC), GPDMA_CxDAR is in the same time also updated by the increment/decrement (depending on DDEC) of the GPDMA_CxTR3.DAO value, as it is usually done at the end of each programmed burst transfer.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <name>BRDDEC</name>
                  <enumeratedValue>
                    <name>Increment</name>
                    <description>Block repeat destination address incremented</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Decrement</name>
                    <description>Block repeat destination address decremented</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
