knieriem/tinygo-stm32-svd/svd/stm32h573.svd
        <register>
          <name>CSR76</name>
          <displayName>CSR76</displayName>
          <description>HASH context swap register 76</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 76
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR77</name>
          <displayName>CSR77</displayName>
          <description>HASH context swap register 77</description>
          <addressOffset>0x22C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 77
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR78</name>
          <displayName>CSR78</displayName>
          <description>HASH context swap register 78</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 78
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR79</name>
          <displayName>CSR79</displayName>
          <description>HASH context swap register 79</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 79
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR80</name>
          <displayName>CSR80</displayName>
          <description>HASH context swap register 80</description>
          <addressOffset>0x238</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 80
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR81</name>
          <displayName>CSR81</displayName>
          <description>HASH context swap register 81</description>
          <addressOffset>0x23C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 81
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR82</name>
          <displayName>CSR82</displayName>
          <description>HASH context swap register 82</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 82
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR83</name>
          <displayName>CSR83</displayName>
          <description>HASH context swap register 83</description>
          <addressOffset>0x244</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 83
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR84</name>
          <displayName>CSR84</displayName>
          <description>HASH context swap register 84</description>
          <addressOffset>0x248</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 84
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR85</name>
          <displayName>CSR85</displayName>
          <description>HASH context swap register 85</description>
          <addressOffset>0x24C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 85
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR86</name>
          <displayName>CSR86</displayName>
          <description>HASH context swap register 86</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 86
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR87</name>
          <displayName>CSR87</displayName>
          <description>HASH context swap register 87</description>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 87
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR88</name>
          <displayName>CSR88</displayName>
          <description>HASH context swap register 88</description>
          <addressOffset>0x258</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 88
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR89</name>
          <displayName>CSR89</displayName>
          <description>HASH context swap register 89</description>
          <addressOffset>0x25C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 89
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR90</name>
          <displayName>CSR90</displayName>
          <description>HASH context swap register 90</description>
          <addressOffset>0x260</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 90
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR91</name>
          <displayName>CSR91</displayName>
          <description>HASH context swap register 91</description>
          <addressOffset>0x264</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 91
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR92</name>
          <displayName>CSR92</displayName>
          <description>HASH context swap register 92</description>
          <addressOffset>0x268</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 92
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR93</name>
          <displayName>CSR93</displayName>
          <description>HASH context swap register 93</description>
          <addressOffset>0x26C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 93
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR94</name>
          <displayName>CSR94</displayName>
          <description>HASH context swap register 94</description>
          <addressOffset>0x270</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 94
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR95</name>
          <displayName>CSR95</displayName>
          <description>HASH context swap register 95</description>
          <addressOffset>0x274</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 95
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR96</name>
          <displayName>CSR96</displayName>
          <description>HASH context swap register 96</description>
          <addressOffset>0x278</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 96
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR97</name>
          <displayName>CSR97</displayName>
          <description>HASH context swap register 97</description>
          <addressOffset>0x27C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 97
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR98</name>
          <displayName>CSR98</displayName>
          <description>HASH context swap register 98</description>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 98
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR99</name>
          <displayName>CSR99</displayName>
          <description>HASH context swap register 99</description>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 99
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR100</name>
          <displayName>CSR100</displayName>
          <description>HASH context swap register 100</description>
          <addressOffset>0x288</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 100
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR101</name>
          <displayName>CSR101</displayName>
          <description>HASH context swap register 101</description>
          <addressOffset>0x28C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 101
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR102</name>
          <displayName>CSR102</displayName>
          <description>HASH context swap register 102</description>
          <addressOffset>0x290</addressOffset>
          <size>0x20</size>
          <resetValue>0x00220002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSx</name>
              <description>Context swap 102
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HR0</name>
          <displayName>HR0</displayName>
          <description>HASH digest register</description>
          <addressOffset>0x310</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Hx</name>
              <description>Hash data x
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HR1</name>
          <displayName>HR1</displayName>
          <description>HASH digest register</description>
          <addressOffset>0x314</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Hx</name>
              <description>Hash data x
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HR2</name>
          <displayName>HR2</displayName>
          <description>HASH digest register</description>
          <addressOffset>0x318</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Hx</name>
              <description>Hash data x
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HR3</name>
          <displayName>HR3</displayName>
          <description>HASH digest register</description>
          <addressOffset>0x31C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Hx</name>
              <description>Hash data x
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HR4</name>
          <displayName>HR4</displayName>
          <description>HASH digest register</description>
          <addressOffset>0x320</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Hx</name>
              <description>Hash data x
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HR5</name>
          <displayName>HR5</displayName>
          <description>HASH digest register</description>
          <addressOffset>0x324</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Hx</name>
              <description>Hash data x
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HR6</name>
          <displayName>HR6</displayName>
          <description>HASH digest register</description>
          <addressOffset>0x328</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Hx</name>
              <description>Hash data x
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HR7</name>
          <displayName>HR7</displayName>
          <description>HASH digest register</description>
          <addressOffset>0x32C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Hx</name>
              <description>Hash data x
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HR8</name>
          <displayName>HR8</displayName>
          <description>HASH digest register</description>
          <addressOffset>0x330</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Hx</name>
              <description>Hash data x
Refer to  introduction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
