knieriem/tinygo-stm32-svd/svd/stm32h573.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>SEC_I2C1</name>
      <baseAddress>0x50005400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2</name>
      <baseAddress>0x40005800</baseAddress>
      <interrupt>
        <name>I2C2_EV</name>
        <description>I2C2 event interrupt</description>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>I2C2_ER</name>
        <description>I2C2 error interrupt</description>
        <value>54</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>SEC_I2C2</name>
      <baseAddress>0x50005800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C3</name>
      <baseAddress>0x44002800</baseAddress>
      <interrupt>
        <name>I2C3_EV</name>
        <description>I2C3 event interrupt</description>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>I2C3_ER</name>
        <description>I2C3 error interrupt</description>
        <value>81</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>SEC_I2C3</name>
      <baseAddress>0x54002800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C4</name>
      <baseAddress>0x44002C00</baseAddress>
      <interrupt>
        <name>I2C4_EV</name>
        <description>I2C4 event interrupt</description>
        <value>125</value>
      </interrupt>
      <interrupt>
        <name>I2C4_ER</name>
        <description>I2C4 error interrupt</description>
        <value>126</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>SEC_I2C4</name>
      <baseAddress>0x54002C00</baseAddress>
    </peripheral>
    <peripheral>
      <name>I3C</name>
      <description>Improved inter-integrated circuit</description>
      <groupName>I3C</groupName>
      <baseAddress>0x40005C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I3C1_EV</name>
        <description>I3C1 event interrupt</description>
        <value>123</value>
      </interrupt>
      <interrupt>
        <name>I3C1_ER</name>
        <description>I3C1 error interrupt</description>
        <value>124</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>I3C message control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCNT</name>
              <description>count of data to transfer during a read or write message, in bytes (whatever I3C is acting as controller/target)
Linear encoding up to 64 Kbytes -1
...</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RNW</name>
              <description>read / non-write message (when I3C is acting as controller)
When I3C is acting as controller, this field is used if MTYPE[3:0]=0010 (private message) or MTYPE[3:0]=0011 (direct message) or MTYPE[3:0]=0100 (legacy I2C message), in order to emit the RnW bit on the I3C bus.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ADD</name>
              <description>7-bit I3C dynamic / I2C static target address (when I3C is acting as controller)
When I3C is acting as controller, this field is used if MTYPE[3:0]=0010 (private message) or MTYPE[3:0]=0011 (direct message) or MTYPE[3:0]=0100 (legacy I2C message)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>7</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MTYPE</name>
              <description>message type (whatever I3C is acting as controller/target)
Bits[26:0] are ignored.
After M2 error detection on an I3C SDR message, this is needed for SCL 'stuck at' recovery.
Bits[26:0] are ignored.
If I3C_CFGR.EXITPTRN=1, an HDR exit pattern is emitted on the bus to generate an escalation fault.
Bits[23:17] (ADD[6:0]) is the emitted 7-bit dynamic address.
Bit[16] (RNW) is the emitted RnW bit.
The transferred private message is:
{S / S+7'h7E+RnW=0+Sr / Sr+*} + 7-bit DynAddr + RnW + (8-bit Data + T)* + Sr/P.
After a S (START), depending on I3C_CFGR.NOARBH, the arbitrable header (7'h7E+RnW=0) is inserted or not.
Sr+*: after a Sr (Repeated Start), the hardware automatically inserts (7'h7E+RnW=0) if needed, i.e. if it follows an I3C direct message without ending by a P (Stop).
Bits[23:17] (ADD[6:0]) is the emitted 7-bit dynamic address.
Bit[16] (RNW) is the emitted RnW bit.
The transferred direct message is:
Sr + 7-bit DynAddr + RnW + (8-bit Data + T)* + Sr/P
Bits[23:17] (ADD[6:0]) is the emitted 7-bit static address.
Bit[16] (RNW) is the emitted RnW bit.
The transferred legacy I2C message is:
{S / S+ 7'h7E+RnW=0 + Sr / Sr+*} + 7-bit StaAddr + RnW + (8-bit Data + T)* + Sr/P.
After a S (START), depending on I3C_CFGR.NOARBH, the arbitrable header (7'h7E+RnW=0) is inserted or not.
Sr+*: after a Sr (Repeated Start), the hardware automatically inserts (7'h7E+RnW=0) if needed, i.e. if it follows an I3C direct message without ending by a P (Stop).
1xxx: reserved (when I3C is acting as I3C controller, used when target)
0xxx: reserved
{S +} 7'h02 addr + RnW=0
{S +} 7-bit I3C_DEVR0.DA[6:0] + RnW=0
after a bus available condition (the target first emits a START request), or once the controller drives a START.
{S +} 7-bit I3C_DEVR0.DA[6:0] + RnW=1 (+Ack/Nack from controller)
When acknowledged from controller, the next (optional, depending on I3C_BCR.BCR2) transmitted IBI payload data is defined by I3C_CR.DCNT[15:0] and must be consistently programmed vs the maximum IBI payload data size which is defined by I3C_IBIDR.IBIP[2:0].
Others: reserved</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MEND</name>
              <description>message end type (when the I3C is acting as controller)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR_ALTERNATE</name>
          <displayName>CR_ALTERNATE</displayName>
          <description>I3C message control register alternate</description>
          <alternateRegister>CR</alternateRegister>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCNT</name>
              <description>count of data to transfer during a read or write message, in bytes (when I3C is acting as controller)
Linear encoding up to 64 Kbytes -1.
...</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CCC</name>
              <description>8-bit CCC code (when I3C is acting as controller)
If Bit[23]=CCC[7]=1, this is the 1st part of an I3C SDR direct CCC command.
If Bit[23]=CCC[7]=0, this is an I3C SDR broadcast CCC command (including ENTDAA and ENTHDR0).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MTYPE</name>
              <description>message type (when I3C is acting as controller)
Bits[23:16] (CCC[7:0]) is the emitted 8-bit CCC code
If Bit[23]=CCC[7]=1: this is the 1st part of an I3C SDR direct CCC command
The transferred direct CCC command message is:
{S / S+7'h7E +RnW=0 / Sr+*} + (direct CCC + T) + (8-bit Data + T)* + Sr
After a S (START), depending on I3C_CFGR.NOARBH, the arbitrable header (7'h7E+RnW=0) is inserted or not.
Sr+*: after a Sr (Repeated Start), the hardware automatically inserts (7'h7E+R/W).
If Bit[23]=CCC[7]=0: this is an I3C SDR broadcast CCC command (including ENTDAA and ENTHDR0)
The transferred broadcast CCC command message is:
{S / S+7'h7E +RnW=0 / Sr+*} + (broadcast CCC + T) + (8-bit Data + T)* + Sr/P
After a S (START), depending on I3C_CFGR.NOARBH, the arbitrable header (7'h7E+RnW=0) is inserted or not.
Sr+*: after a Sr (Repeated Start), the hardware automatically inserts (7'h7E+R/W).
others: reserved</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MEND</name>
              <description>message end type (when I3C is acting as controller)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <displayName>CFGR</displayName>
          <description>I3C configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>I3C enable (whatever I3C is acting as controller/target)
- Except registers, the peripheral is under reset (a.k.a. partial reset).
- Before clearing EN, when I3C is acting as a controller, all the possible target requests must be disabled using DISEC CCC.
- When I3C is acting as a target, software should not disable the I3C, unless a partial reset is needed.
In this state, some register fields can not be modified (like CRINIT, HKSDAEN for the I3C_CFGR)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRINIT</name>
              <description>initial controller/target role
This bit can be modified only when I3C_CFGR.EN = 0.
Once enabled by setting I3C_CFGR.EN = 1, I3C peripheral initially acts as an I3C target. I3C does not drive SCL line and does not enable SDA pull-up, until it eventually acquires the controller role.
Once enabled by setting I3C_CFGR.EN = 1, I3C peripheral initially acts as a controller. It has the I3C controller role, so drives SCL line and enables SDA pull-up, until it eventually offers the controller role to an I3C secondary controller.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOARBH</name>
              <description>no arbitrable header after a START (when I3C is acting as a controller)
This bit can be modified only when there is no on-going frame.
- The target address is emitted directly after a START in case of a legacy I2C message or an I3C SDR private read/write message.
- This is a more performing option (when is useless the emission of the 0x7E arbitrable header), but this is to be used only when the controller is sure that the addressed target device can not emit concurrently an IBI or a controller-role request (to insure no misinterpretation and no potential conflict between the address emitted by the controller in open-drain mode and the same address a target device can emit after a START, for IBI or MR).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTPTRN</name>
              <description>HDR reset pattern enable (when I3C is acting as a controller)
This bit can be modified only when there is no on-going frame.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXITPTRN</name>
              <description>HDR Exit Pattern enable (when I3C is acting as a controller)
This bit can be modified only when there is no on-going frame.
This is used to send only the header to test ownership of the bus when there is a suspicion of problem after controller-role hand-off (new controller didn't assert its controller-role by accessing the previous one in less than Activity State time).
The HDR Exit Pattern is sent even if the message header {S/Sr + 0x7E addr + W } is ACKed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HKSDAEN</name>
              <description>High-keeper enable on SDA line (when I3C is acting as a controller)
This bit can be modified only when I3C_CFGR.EN=0.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HJACK</name>
              <description>Hot Join request acknowledge (when I3C is acting as a controller)
After the NACK, the message continues as initially programmed (the hot-joining target is aware of the NACK and surely emits another hot-join request later on).
After the ACK, the message continues as initially programmed. The software is aware by the HJ interrupt (flag I3C_EVR.HJF is set) and initiates the ENTDAA sequence later on, potentially preventing others Hot Join requests with a Disable target events command (DISEC, with DISHJ=1).
Independently of the HJACK configuration, further Hot Join request(s) are NACKed until the Hot Join flag, HJF, is cleared. However, a NACKed target can be assigned a dynamic address by the ENTDAA sequence initiated later on by the first HJ request, preventing this target to emit an HJ request again.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDMAEN</name>
              <description>RX-FIFO DMA request enable (whatever I3C is acting as controller/target)
- Software reads and pops a data byte/word from RX-FIFO i.e. reads I3C_RDR or I3C_RDWR register.
- A next data byte/word is to be read by the software either via polling on the flag I3C_EVR.RXFNEF=1 or via interrupt notification (enabled by I3C_IER.RXFNEIE=1).
- DMA reads and pops data byte(s)/word(s) from RX-FIFO i.e. reads I3C_RDR or I3C_RDWR register.
- A next data byte/word is automatically read by the programmed hardware (i.e. via the asserted RX-FIFO DMA request from the I3C and the programmed DMA channel).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFLUSH</name>
              <description>RX-FIFO flush (whatever I3C is acting as controller/target)
This bit can only be written.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXTHRES</name>
              <description>RX-FIFO threshold (whatever I3C is acting as controller/target)
This threshold defines, compared to the RX-FIFO level, when the I3C_EVR.RXFNEF flag is set (and consequently if RXDMAEN=1 when is asserted a DMA RX request).
RXFNEF is set when 1 byte is to be read in RX-FIFO (i.e. in I3C_RDR).
RXFNEF is set when 4 bytes are to be read in RX-FIFO (i.e. in I3C_RDWR).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDMAEN</name>
              <description>TX-FIFO DMA request enable (whatever I3C is acting as controller/target)
- Software writes and pushes a data byte/word into TX-FIFO i.e. writes I3C_TDR or I3C_TDWR register, to be transmitted over the I3C bus.
- A next data byte/word is to be written by the software either via polling on the flag I3C_EVR.TXFNFF=1 or via interrupt notification (enabled by I3C_IER.TXFNFIE=1).
- DMA writes and pushes data byte(s)/word(s) into TX-FIFO i.e. writes I3C_TDR or I3C_TDWR register.
- A next data byte/word transfer is automatically pushed by the programmed hardware (i.e. via the asserted TX-FIFO DMA request from the I3C and the programmed DMA channel).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFLUSH</name>
              <description>TX-FIFO flush (whatever I3C is acting as controller/target)
This bit can only be written.
When the I3C is acting as target, this bit can be used to flush the TX-FIFO on a private read if the controller has early ended the read data (i.e. driven low the T bit) and there is/are remaining data in the TX-FIFO (i.e. I3C_SR.ABT=1 and I3C_SR.XDCNT[15:0]   I3C_TGTTDR.TGTTDCNT[15:0]).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXTHRES</name>
              <description>TX-FIFO threshold (whatever I3C is acting as controller/target)
This threshold defines, compared to the TX-FIFO level, when the I3C_EVR.TXFNFF flag is set (and consequently if TXDMAEN=1 when is asserted a DMA TX request).
TXFNFF is set when 1 byte is to be written in TX-FIFO (i.e. in I3C_TDR).
TXFNFF is set when 4 bytes are to be written in TX-FIFO (i.e. in I3C_TDWR).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDMAEN</name>
              <description>S-FIFO DMA request enable (when I3C is acting as controller)
Condition: When RMODE=1 (FIFO is enabled for the status):
- Software reads and pops a status word from S-FIFO i.e. reads I3C_SR register after a completed frame (I3C_EVR.FCF=1) or an error (I3C_EVR.ERRF=1).
- A status word can be read by the software either via polling on these register flags or via interrupt notification (enabled by I3C_IER.FCIE=1 and I3C_IER.ERRIE=1).
- DMA reads and pops status word(s) from S-FIFO i.e. reads I3C_SR register.
- Status word(s) are automatically read by the programmed hardware (i.e. via the asserted S-FIFO DMA request from the I3C and the programmed DMA channel).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFLUSH</name>
              <description>S-FIFO flush (when I3C is acting as controller)
When I3C is acting as I3C controller, this bit can only be written (and is only used when I3C is acting as controller).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RMODE</name>
              <description>S-FIFO enable / status receive mode (when I3C is acting as controller)
When I3C is acting as I3C controller, this bit is used for the enabling the FIFO for the status (S-FIFO) vs the received status from the target on the I3C bus.
When I3C is acting as target, this bit must be cleared.
- Status register (i.e. I3C_SR) is used without FIFO mechanism.
- There is no SCL stretch if a new status register content is not read.
- Status register must be read before being lost/overwritten.
All message status must be read.
There is SCL stretch when there is no more space in the S-FIFO.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMODE</name>
              <description>transmit mode (when I3C is acting as controller)
When I3C is acting as I3C controller, this bit is used for the C-FIFO and TX-FIFO management vs the emitted frame on the I3C bus.
A frame transfer starts as soon as first control word is present in C-FIFO.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CDMAEN</name>
              <description>C-FIFO DMA request enable (when I3C is acting as controller)
When I3C is acting as controller:
- Software writes and pushes control word(s) into C-FIFO i.e. writes I3C_CR register, as needed for a given frame.
- A next control word transfer can be written by software either via polling on the flag I3C_EVR.CFNFF=1 or via interrupt notification (enabled by I3C_IER.CFNFIE=1).
- DMA writes and pushes control word(s) into C-FIFO i.e. writes I3C_CR register, as needed for a given frame.
- A next control word transfer is automatically written by the programmed hardware (i.e. via the asserted C-FIFO DMA request from the I3C and the programmed DMA channel).</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CFLUSH</name>
              <description>C-FIFO flush (when I3C is acting as controller)
This bit can only be written.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TSFSET</name>
              <description>frame transfer set (a.k.a. software trigger) (when I3C is acting as controller)
This bit can only be written.
When I3C is acting as I3C controller:
Note: If this bit is not set, the other alternative for the software to initiate a frame transfer is to directly write the first control word register (i.e. I3C_CR) while C-FIFO is empty (i.e. I3C_EVR.CFEF=1). Then, if the first written control word is not tagged as a message end (i.e I3C_CR.MEND=0), it causes the hardware to assert the flag I3C_EVR.CFNFF (C-FIFO not full and a next control word is needed).</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDR</name>
          <displayName>RDR</displayName>
          <description>I3C receive data byte register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDB0</name>
              <description>8-bit received data on I3C bus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
