knieriem/tinygo-stm32-svd/svd/stm32h573.svd
        <register>
          <name>RDWR</name>
          <displayName>RDWR</displayName>
          <description>I3C receive data word register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDB0</name>
              <description>8-bit received data (earliest byte on I3C bus).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB1</name>
              <description>8-bit received data (next byte after RDB0 on I3C bus).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB2</name>
              <description>8-bit received data (next byte after RDB1 on I3C bus).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB3</name>
              <description>8-bit received data (latest byte on I3C bus).</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TDR</name>
          <displayName>TDR</displayName>
          <description>I3C transmit data byte register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TDB0</name>
              <description>8-bit data to transmit on I3C bus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TDWR</name>
          <displayName>TDWR</displayName>
          <description>I3C transmit data word register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TDB0</name>
              <description>8-bit transmit data (earliest byte on I3C bus)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TDB1</name>
              <description>8-bit transmit data (next byte after TDB0[7:0] on I3C bus).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TDB2</name>
              <description>8-bit transmit data (next byte after TDB1[7:0] on I3C bus).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TDB3</name>
              <description>8-bit transmit data (latest byte on I3C bus).</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBIDR</name>
          <displayName>IBIDR</displayName>
          <description>I3C IBI payload data register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IBIDB0</name>
              <description>8-bit IBI payload data (earliest byte on I3C bus, i.e. MDB[7:0] mandatory data byte).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIDB1</name>
              <description>8-bit IBI payload data (next byte on I3C bus after IBIDB0[7:0]).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIDB2</name>
              <description>8-bit IBI payload data (next byte on I3C bus after IBIDB1[7:0]).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIDB3</name>
              <description>8-bit IBI payload data (latest byte on I3C bus).</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TGTTDR</name>
          <displayName>TGTTDR</displayName>
          <description>I3C target transmit configuration register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TGTTDCNT</name>
              <description>transmit data counter, in bytes (when I3C is configured as target)
This field must be written by software in the same access when is asserted PRELOAD, in order to define the number of bytes to preload and to transmit.
This field is updated by hardware and reports, when read, the remaining number of bytes to be loaded into the TX-FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRELOAD</name>
              <description>preload of the TX-FIFO (when I3C is configured as target)
This bit must be written and asserted by software in the same access when is written and defined the number of bytes to preload into the TX-FIFO and to transmit.
This bit is cleared by hardware when all the data bytes to transmit are loaded into the TX-FIFO.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>I3C status register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XDCNT</name>
              <description>data counter
- When the I3C is acting as controller: number of targets detected on the bus
- When the I3C is acting as target: number of transmitted bytes
- Whatever the I3C is acting as controller or target: number of data bytes read from or transmitted on the I3C bus during the MID[7:0] message</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ABT</name>
              <description>a private read message is completed/aborted prematurely by the target (when the I3C is acting as controller)
When the I3C is acting as controller, this bit indicates if the private read data which is transmitted by the target early terminates (i.e. the target drives T bit low earlier vs what does expect the controller in terms of programmed number of read data bytes i.e. I3C_CR.DCNT[15:0]).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIR</name>
              <description>message direction
Whatever the I3C is acting as controller or target, this bit indicates the direction of the related message on the I3C bus
Note: ENTDAA CCC is considered as a write command.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MID</name>
              <description>message identifier/counter of a given frame (when the I3C is acting as controller)
When the I3C is acting as controller, this field identifies the control word message (i.e. I3C_CR) to which the I3C_SR status register refers.
First message of a frame is identified with MID[7:0]=0.
This field is incremented (by hardware) on the completion of a new message control word (i.e. I3C_CR) over I3C bus. This field is reset for every new frame start.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SER</name>
          <displayName>SER</displayName>
          <description>I3C status error register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CODERR</name>
              <description>protocol error code/type
controller detected an illegally formatted CCC
controller detected that transmitted data on the bus is different from expected
controller detected a not acknowledged broadcast address (7'hE)
controller detected the new controller did not drive bus after controller-role hand-off
target detected an invalid broadcast address 7'hE+W
target detected a parity error on a CCC code via a parity check (vs T bit)
target detected a parity error on a write data via a parity check (vs T bit)
target detected a parity error on the assigned address during dynamic address arbitration via a parity check (vs PAR bit)
target detected a 7'hE+R missing after Sr during dynamic address arbitration
target detected an illegally formatted CCC
target detected that transmitted data on the bus is different from expected
others: reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PERR</name>
              <description>protocol error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STALL</name>
              <description>SCL stall error (when the I3C is acting as target)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DOVR</name>
              <description>RX-FIFO overrun or TX-FIFO underrun
i) a TX-FIFO underrun: TX-FIFO is empty and a write data byte has to be transmitted
ii) a RX-FIFO overrun: RX-FIFO is full and a new data byte is received</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COVR</name>
              <description>C-FIFO underrun or S-FIFO overrun (when the I3C is acting as controller)
i) a C-FIFO underrun: control FIFO is empty and a restart has to be emitted
ii) a S-FIFO overrun: S-FIFO is full and a new message ends</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANACK</name>
              <description>address not acknowledged (when the I3C is configured as controller)
i) a legacy I2C read/write transfer
ii) a direct CCC write transfer
iii) the second trial of a direct CCC read transfer
iv) a private read/write transfer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DNACK</name>
              <description>data not acknowledged (when the I3C is acting as controller)
i) a legacy I2C write transfer
ii) the second trial when sending dynamic address during ENTDAA procedure</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DERR</name>
              <description>data error (when the I3C is acting as controller)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RMR</name>
          <displayName>RMR</displayName>
          <description>I3C received message register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IBIRDCNT</name>
              <description>IBI received payload data count (when the I3C is configured as controller)
When the I3C is configured as controller, this field logs the number of data bytes effectively received in the I3C_IBIDR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RCODE</name>
              <description>received CCC code (when the I3C is configured as target)
When the I3C is configured as target, this field logs the received CCC code.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RADD</name>
              <description>received target address (when the I3C is configured as controller)
When the I3C is configured as controller, this field logs the received dynamic address from the target during acknowledged IBI or controller-role request.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
