knieriem/tinygo-stm32-svd/svd/stm32h573.svd
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>I3C interrupt enable register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFNFIE</name>
              <description>C-FIFO not full interrupt enable (whatever the I3C is acting as controller/target)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SFNEIE</name>
              <description>S-FIFO not empty interrupt enable (whatever the I3C is acting as controller/target)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFNFIE</name>
              <description>TX-FIFO not full interrupt enable (whatever the I3C is acting as controller/target)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFNEIE</name>
              <description>RX-FIFO not empty interrupt enable (whatever the I3C is acting as controller/target)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FCIE</name>
              <description>frame complete interrupt enable (whatever the I3C is acting as controller/target)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXTGTENDIE</name>
              <description>target-initiated read end interrupt enable (when the I3C is acting as controller)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERRIE</name>
              <description>error interrupt enable (whatever the I3C is acting as controller/target)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIIE</name>
              <description>IBI request interrupt enable (when the I3C is acting as controller)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IBIENDIE</name>
              <description>IBI end interrupt enable (when the I3C is acting as target)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRIE</name>
              <description>controller-role request interrupt enable (when the I3C is acting as controller)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRUPDIE</name>
              <description>controller-role update interrupt enable (when the I3C is acting as target)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HJIE</name>
              <description>hot-join interrupt enable (when the I3C is acting as controller)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WKPIE</name>
              <description>wakeup interrupt enable (when the I3C is acting as target)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GETIE</name>
              <description>GETxxx CCC interrupt enable (when the I3C is acting as target)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STAIE</name>
              <description>GETSTATUS CCC interrupt enable (when the I3C is acting as target)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAUPDIE</name>
              <description>ENTDAA/RSTDAA/SETNEWDA CCC interrupt enable (when the I3C is acting as target)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MWLUPDIE</name>
              <description>SETMWL CCC interrupt enable (when the I3C is acting as target)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MRLUPDIE</name>
              <description>SETMRL CCC interrupt enable (when the I3C is acting as target)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSTIE</name>
              <description>reset pattern interrupt enable (when the I3C is acting as target)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ASUPDIE</name>
              <description>ENTASx CCC interrupt enable (when the I3C is acting as target)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTUPDIE</name>
              <description>ENEC/DISEC CCC interrupt enable (when the I3C is acting as target)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEFIE</name>
              <description>DEFTGTS CCC interrupt enable (when the I3C is acting as target)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GRPIE</name>
              <description>DEFGRPA CCC interrupt enable (when the I3C is acting as target)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CEVR</name>
          <displayName>CEVR</displayName>
          <description>I3C clear event register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFCF</name>
              <description>clear frame complete flag (whatever the I3C is acting as controller/target)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CRXTGTENDF</name>
              <description>clear target-initiated read end flag (when the I3C is acting as controller)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CERRF</name>
              <description>clear error flag (whatever the I3C is acting as controller/target)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CIBIF</name>
              <description>clear IBI request flag (when the I3C is acting as controller)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CIBIENDF</name>
              <description>clear IBI end flag (when the I3C is acting as target)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CCRF</name>
              <description>clear controller-role request flag (when the I3C is acting as controller)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CCRUPDF</name>
              <description>clear controller-role update flag (when the I3C is acting as target)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHJF</name>
              <description>clear hot-join flag (when the I3C is acting as controller)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CWKPF</name>
              <description>clear wakeup flag (when the I3C is acting as target)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CGETF</name>
              <description>clear GETxxx CCC flag (when the I3C is acting as target)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSTAF</name>
              <description>clear GETSTATUS CCC flag (when the I3C is acting as target)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CDAUPDF</name>
              <description>clear ENTDAA/RSTDAA/SETNEWDA CCC flag (when the I3C is acting as target)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CMWLUPDF</name>
              <description>clear SETMWL CCC flag (when the I3C is acting as target)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CMRLUPDF</name>
              <description>clear SETMRL CCC flag (when the I3C is acting as target)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CRSTF</name>
              <description>clear reset pattern flag (when the I3C is acting as target)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CASUPDF</name>
              <description>clear ENTASx CCC flag (when the I3C is acting as target)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CINTUPDF</name>
              <description>clear ENEC/DISEC CCC flag (when the I3C is acting as target)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CDEFF</name>
              <description>clear DEFTGTS CCC flag (when the I3C is acting as target)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CGRPF</name>
              <description>clear DEFGRPA CCC flag (when the I3C is acting as target)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVR0</name>
          <displayName>DEVR0</displayName>
          <description>I3C own device characteristics register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAVAL</name>
              <description>dynamic address is valid (when the I3C is acting as target)
When the I3C is acting as controller, this field can be written by software, for validating its own dynamic address, for example before a controller-role hand-off.
When the I3C is acting as target, this field is asserted by hardware on the acknowledge of the broadcast ENTDAA CCC or the direct SETNEWDA CCC, and this field is cleared by hardware on the acknowledge of the broadcast RSTDAA CCC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DA</name>
              <description>7-bit dynamic address
When the I3C is acting as controller, this field can be written by software, for defining its own dynamic address.
When the I3C is acting as target, this field is updated by hardware on the reception of either the broadcast ENTDAA CCC or the direct SETNEWDA CCC.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIEN</name>
              <description>IBI request enable (when the I3C is acting as target)
This field is initially written by software when I3C_CFGR.EN=0, and is updated by hardware on the reception of DISEC CCC with DISINT=1 (i.e. cleared) and the reception of ENEC CCC with ENINT=1 (i.e. set).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CREN</name>
              <description>controller-role request enable (when the I3C is acting as target)
This field is initially written by software when I3C_CFGR.EN=0, and is updated by hardware on the reception of DISEC CCC with DISCR=1 (i.e. cleared) and the reception of ENEC CCC with ENCR=1 (i.e. set).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HJEN</name>
              <description>hot-join request enable (when the I3C is acting as target)
This field is initially written by software when I3C_CFGR.EN=0, and is updated by hardware on the reception of DISEC CCC with DISHJ=1 (i.e. cleared) and the reception of ENEC CCC with ENHJ=1 (i.e. set).</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AS</name>
              <description>activity state (when the I3C is acting as target)
This read field is updated by hardware on the reception of a ENTASx CCC (enter activity state, with x=0-3):</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSTACT</name>
              <description>reset action/level on received reset pattern (when the I3C is acting as target)
This read field is used by hardware on the reception of a direct read RSTACT CCC in order to return the corresponding data byte on the I3C bus.
This read field is updated by hardware on the reception of a broadcast or direct write RSTACT CCC (target reset action).
Only the defining bytes 0x00, 0x01 and 0x02 are mapped, and RSTACT[1:0] = Defining Byte[1:0].
a) partially reset the I3C peripheral, by a write and clear of the enable bit of the i3C
configuration register (i.e. write I3C_CFGR.EN=0). This reset the I3C bus interface
and the I3C kernel sub-parts, without modifying the content of the I3C APB registers
(excepted the I3C_CFGR.EN bit).
b) reset fully the I3C peripheral including all its registers via a write and set to the I3C
reset control bit of the RCC (Reset and Clock Controller) register.
a system reset. This has the same impact as a pin reset (i.e. NRST=0) (refer to RCC functional description Reset part):
the software writes and set the AICR.SYSRESETREQ register control bit, when the
device is controlled by a CortexTM-M.
the software writes and set the RCC_GRSTCSETR.SYSRST=1, when the device is
controlled by a CortexTM-A.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSTVAL</name>
              <description>reset action is valid (when the I3C is acting as target)
This read bit is asserted by hardware to indicate that the RTSACT[1:0] field has been updated on the reception of a broadcast or direct write RSTACT CCC (target reset action) and is valid.
This field is cleared by hardware when the target receives a frame start.
If RSTVAL=1: when the RSTF is asserted (and/or the corresponding interrupt if enabled), I3C_DEVR0.RSTACT[1:0] dictates the reset action to be performed by the software if any.
If RSTVAL=0: when the RSTF is asserted (and/or the corresponding interrupt if enabled), the software should issue an I3C reset after a first detected reset pattern, and a system reset on the second one.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
