knieriem/tinygo-stm32-svd/svd/stm32h573.svd
        <register>
          <name>MAXRLR</name>
          <displayName>MAXRLR</displayName>
          <description>I3C maximum read length register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MRL</name>
              <description>maximum data read length (when I3C is acting as target)
This field is initially written by software when I3C_CFGR.EN=0 and updated by hardware on the reception of SETMRL command (with potentially also updated IBIP[2:0]).
Software is notified of a MRL update by the I3C_EVR.MRLUPF and the corresponding interrupt if enabled.
This field is used by hardware to return the value on the I3C bus when the target receives a GETMRL CCC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIP</name>
              <description>IBI payload data size, in bytes (when I3C is acting as target)
This field is initially written by software when I3C_CFGR.EN=0 to set the number of data bytes to be sent to the controller after an IBI request has been acknowledged.This field may be updated by hardware on the reception of SETMRL command (which potentially also updated IBIP[2:0]).
Software is notified of a MRL update by the I3C_EVR.MRLUPF and the corresponding interrupt if enabled.
others: same as 100</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAXWLR</name>
          <displayName>MAXWLR</displayName>
          <description>I3C maximum write length register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MWL</name>
              <description>maximum data write length (when I3C is acting as target)
This field is initially written by software when I3C_CFGR.EN=0 and updated by hardware on the reception of SETMWL command.
Software is notified of a MWL update by the I3C_EVR.MWLUPF and the corresponding interrupt if enabled.
This field is used by hardware to return the value on the I3C bus when the target receives a GETMWL CCC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGR0</name>
          <displayName>TIMINGR0</displayName>
          <description>I3C timing register 0</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCLL_PP</name>
              <description>SCL low duration in I3C push-pull phases, in number of kernel clocks cycles:
tSCLL_PP = (SCLL_PP + 1) x tI3CCLK
SCLL_PP is used to generate tLOW (I3C) timing.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCLH_I3C</name>
              <description>SCL high duration, used for I3C messages (both in push-pull and open-drain phases), in number of kernel clocks cycles:
tSCLH_I3C = (SCLH_I3C + 1) x tI3CCLK
SCLH_I3C is used to generate both tHIGH (I3C) and tHIGH_MIXED timings.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCLL_OD</name>
              <description>SCL low duration in open-drain phases, used for legacy I2C commands and for I3C open-drain phases (address header phase following a START, not a Repeated START), in number of kernel clocks cycles:
tSCLL_OD = (SCLL_OD + 1) x tI3CCLK
SCLL_OD is used to generate both tLOW (I2C) and tLOW_OD timings (max. of the two).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCLH_I2C</name>
              <description>SCL high duration, used for legacy I2C commands, in number of kernel clocks cycles:
tSCLH_I2C = (SCLH_I2C + 1) x tI3CCLK
SCLH_I2C is used to generate tHIGH (I2C) timing.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGR1</name>
          <displayName>TIMINGR1</displayName>
          <description>I3C timing register 1</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AVAL</name>
              <description>number of kernel clock cycles, that is used whatever I3C is acting as controller or target, to set the following MIPI I3C timings, like bus available condition time:
When the I3C is acting as target:
for bus available condition time: it must wait for (bus available condition) time to be elapsed after a stop and before issuing a start request for an IBI or a controller-role request (i.e. bus free condition is sustained for at least tAVAL). refer to MIPI timing tAVAL = 1 s. This timing is defined by:
tAVAL = (AVAL[7:0] + 2) x tI3CCLK
for bus idle condition time: it must wait for (bus idle condition) time to be elapsed after that both SDA and SCL are continuously high and stable before issuing a hot-join event. Refer to MIPI v1.1 timing tIDLE = 200 s . This timing is defined by:
tIDLE = (AVAL[7:0] + 2) x 200 x tI3CCLK
When the I3C is acting as controller, it can not stall the clock beyond a maximum stall time (i.e. stall the SCL clock low), as follows:
on first bit of assigned address during dynamic address assignment: it can not stall the clock beyond the MIPI timing tSTALLDAA = 15 ms. This timing is defined by:
tSTALLDAA = (AVAL[7:0] + 1) x 15000 x tI3CCLK
on ACK/NACK phase of I3C/I2C transfer, on parity bit of write data transfer, on transition bit of I3C read transfer: it can not stall the clock beyond the MIPI timing tSTALL = 100 s. This timing is defined by:
tSTALL = (AVAL[7:0] + 1) x 100 x tI3CCLK
Whatever the I3C is acting as controller or as (controller-capable) target, during a controller-role hand-off procedure:
The new controller must wait for a time (refer to MIPI timing tNEWCRLock) before pulling SDA low (i.e. issuing a start). And the active controller must wait for the same time while monitoring new controller and before testing the new controller by pulling SDA low. This time to wait is dependent on the defined I3C_TIMINGR1.ANSCR[1:0], as follows:
If ASNCR[1:0]=00: tNEWCRLock = (AVAL[7:0] + 1)  x tI3CCLK
If ASNCR[1:0]=01: tNEWCRLock = (AVAL[7:0] + 1) x 100 x tI3CCLK
If ASNCR[1:0]=10: tNEWCRLock = (AVAL[7:0] + 1) x 2000 x tI3CCLK
If ASNCR[1:0]=11: tNEWCRLock = (AVAL[7:0] + 1) x 50000 x tI3CCLK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASNCR</name>
              <description>activity state of the new controller (when I3C is acting as active- controller)
This field indicates the time to wait before being accessed as new target, refer to the other field AVAL[7:0].
This field can be modified only when the I3C is acting as controller.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREE</name>
              <description>number of kernel clocks cycles that is used to set some MIPI timings like bus free condition time (when the I3C is acting as controller)
When the I3C is acting as controller:
for I3C start timing: it must wait for (bus free condition) time to be elapsed after a stop and before a start, refer to MIPI timings (I3C) tCAS and (I2C) tBUF. These timings are defined by:
tBUF= tCAS = [ (FREE[6:0]  + 1) x 2 (0,5 + SDA_HD)] x tI3CCLK
Note: for pure I3C bus: tCASmin= 38,4 ns.
Note: for pure I3C bus: tCASmax=1s, 100s, 2ms, 50ms for respectively ENTAS0,1,2, and 3.
Note: for mixed bus with I2C fm+ device: tBUFmin = 0,5 s.
Note: for mixed bus with I2C fm device: tBUFmin = 1,3 s.
for I3C repeated start timing: it must wait for time to be elapsed after a repeated start (i.e. SDA is de-asserted) and before driving SCL low, refer to. MIPI timing tCASr. This timing is defined by:
tCASr = [ (FREE[6:0] + 1) x 2 (0,5 + SDA_HD)] x tI3CCLK
for I3C stop timing: it must wait for time to be elapsed after that the SCL clock is driven high and before the stop condition (i.e. SDA is asserted). This timing is defined by:
tCBP = (FREE[6:0] + 1) x tI3CCLK
for I3C repeated start timing (T-bit when controller ends read with repeated start followed by stop): it must wait for time to be elapsed after that the SCL clock is driven high and before the repeated start condition (i.e. SDA is de-asserted). This timing is defined by:
tCBSr = (FREE[6:0] + 1) x tI3CCLK</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDA_HD</name>
              <description>SDA hold time (when the I3C is acting as controller), in number of kernel clocks cycles (refer to MIPI timing SDA hold time in push-pull tHD_PP):</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGR2</name>
          <displayName>TIMINGR2</displayName>
          <description>I3C timing register 2</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STALLT</name>
              <description>Controller clock stall on T-bit phase of Data enable
The SCL is stalled during STALL x tSCLL_PP in the T-bit phase (before 9th bit). This allows the target to prepare data to be sent.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALLD</name>
              <description>controller clock stall on PAR phase of Data enable
The SCL is stalled during STALL x tSCLL_PP in the T-bit phase (before 9th bit). This allows the target to read received data.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALLC</name>
              <description>controller clock stall on PAR phase of CCC enable
The SCL is stalled during STALL x tSCLL_PP in the T-bit phase of common command code (before 9th bit). This allows the target to decode the command.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALLA</name>
              <description>controller clock stall enable on ACK phase
The SCL is stalled (during tSCLL_STALLas defined by STALL)  in the address ACK/NACK phase (before 9th bit). This allows the target to prepare data or the controller to respond to target interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>controller clock stall time, in number of kernel clock cycles
tSCLL_STALL = STALL x tI3CCLK</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BCR</name>
          <displayName>BCR</displayName>
          <description>I3C bus characteristics register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BCR0</name>
              <description>max data speed limitation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCR2</name>
              <description>in-band interrupt (IBI) payload</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCR6</name>
              <description>controller capable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCR</name>
          <displayName>DCR</displayName>
          <description>I3C device characteristics register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCR</name>
              <description>device characteristics ID
others: ID to describe the type of the I3C sensor/device
Note: The latest MIPI DCR ID assignments are available at: https://www.mipi.org/MIPI_I3C_device_characteristics_register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GETCAPR</name>
          <displayName>GETCAPR</displayName>
          <description>I3C get capability register</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPPEND</name>
              <description>IBI MDB support for pending read notification
This bit is written by software during bus initialization (i.e. I3C_CFGR.EN=0) and indicates the support (or not) of the pending read notification via the IBI MDB[7:0] value.
This bit is used to return the GETCAP3 byte in response to the GETCAPS CCC format 1.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCAPR</name>
          <displayName>CRCAPR</displayName>
          <description>I3C controller-role capability register</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAPDHOFF</name>
              <description>delayed controller-role hand-off
This bit is written by software during bus initialization (i.e. I3C_CFGR.EN=0) and indicates if this target I3C may need additional time to process a controller-role hand-off requested by the current controller.
This bit is used to return the CRCAP2 byte in response to the GETCAPS CCC format 2.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPGRP</name>
              <description>group management support (when acting as controller)
This bit is written by software during bus initialization (i.e. I3C_CFGR.EN=0) and indicates if the I3C is able to support group management when it acts as a controller (after controller-role hand-off) via emitted DEFGRPA, RSTGRPA, and SETGRPA CCC.
This bit is used to return the CRCAP1 byte in response to the GETCAPS CCC format 2.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GETMXDSR</name>
          <displayName>GETMXDSR</displayName>
          <description>I3C get capability register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HOFFAS</name>
              <description>controller hand-off activity state
This bit is written by software during bus initialization (i.e. I3C_CFGR.EN=0) and indicates in which initial activity state the (other) current controller should expect the I3C bus after a controller-role hand-off to this controller-capable I3C, when returning the defining byte CRHDLY (0x91) to a GETMXDS CCC.
This 2-bit field is used to return the CRHDLY1 byte in response to the GETCAPS CCC format 3, in order to state which is the activity state of this I3C when becoming controller after a controller-role hand-off, and consequently the time the former controller should wait before testing this I3C to be confirmed its ownership.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMT</name>
              <description>GETMXDS CCC format</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDTURN</name>
              <description>programmed byte of the 3-byte MaxRdTurn (maximum read turnaround byte)
This bit is written by software during bus initialization (i.e. I3C_CFGR.EN=0) and writes the value of the selected byte (via the FMT[1:0] field) of the 3-byte MaxRdTurn which is returned in response to the GETMXDS CCC format 2 to encode the maximum read turnaround time.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCO</name>
              <description>clock-to-data turnaround time (tSCO)
This bit is written by software during bus initialization (i.e. I3C_CFGR.EN=0) and is used to specify the clock-to-data turnaround time tSCO (vs the value of 12 ns). This bit is used by the hardware in response to the GETMXDS CCC to return the encoded clock-to-data turnaround time via the returned MaxRd[5:3] bits.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPIDR</name>
          <displayName>EPIDR</displayName>
          <description>I3C extended provisioned ID register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <resetValue>0x02080000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MIPIID</name>
              <description>4-bit MIPI Instance ID
This field is written by software to set and identify individually each instance of this I3C IP with a specific number on a single I3C bus.
This field represents the bits[15:12] of the 48-bit provisioned ID.
Note: The bits[11:0] of the provisioned ID may be 0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDTSEL</name>
              <description>provisioned ID type selector
This field is set as 0 i.e. vendor fixed value.
This field represents the bit[32] of the 48-bit provisioned ID.
Note: The bits[31:16] of the provisioned ID may be 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MIPIMID</name>
              <description>15-bit MIPI manufacturer ID
This read field is the 15-bit STMicroelectronics MIPI ID i.e. 0x0104.
This field represents the bits[47:33] of the 48-bit provisioned ID.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
