knieriem/tinygo-stm32-svd/svd/stm32h573.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="PKA">
      <name>SEC_PKA</name>
      <baseAddress>0x520C2000</baseAddress>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power control</description>
      <groupName>PWR</groupName>
      <baseAddress>0x44020800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PMCR</name>
          <displayName>PMCR</displayName>
          <description>PWR power mode control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPMS</name>
              <description>low-power mode selection
This bit defines the Deepsleep mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>LPMS</name>
                <enumeratedValue>
                  <name>StopMode</name>
                  <description>Keeps Stop mode when entering DeepSleep</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>StandbyMode</name>
                  <description>Allows Standby mode when entering DeepSleep</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SVOS</name>
              <description>system Stop mode voltage scaling selection
These bits control the V sub CORE /sub  voltage level in system Stop mode, to obtain the best trade-off between power consumption and performance.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SVOS</name>
                <enumeratedValue>
                  <name>Scale5</name>
                  <description>SVOS5 scale 5</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Scale4</name>
                  <description>SVOS4 scale 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Scale3</name>
                  <description>SVOS3 scale 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSSF</name>
              <description>clear Standby and Stop flags (always read as 0)
This bit is cleared to 0 by hardware.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>CSSF</name>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>STOPF and SBF flags cleared</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLPS</name>
              <description>Flash memory low-power mode in Stop mode
This bit is used to obtain the best trade-off between low-power consumption and restart time when exiting from Stop mode.
When it is set, the Flash memory enters low-power mode when the CPU domain is in Stop mode.
Note: When system enters stop mode with SVOS5 enabled, Flash memory is automatically forced in low-power mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>FLPS</name>
                <enumeratedValue>
                  <name>NormalMode</name>
                  <description>Flash memory remains in normal mode when the system enters Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LowPowerMode</name>
                  <description>Flash memory enters low-power mode when the system enters Stop mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOSTE</name>
              <description>analog switch V sub BOOST /sub  control
This bit enables the booster to guarantee the analog switch AC performance when the V sub DD /sub  supply voltage is below 2.7 V (reduction of the total harmonic distortion to have the same switch performance over the full supply voltage range) The V sub DD /sub  supply voltage can be monitored through the PVD and the PLS bits.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>BOOSTE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Booster disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Booster enabled if analog voltage ready (AVD_READY = 1)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVD_READY</name>
              <description>analog voltage ready
This bit is only used when the analog switch boost needs to be enabled (see BOOSTE bit).
It must be set by software when the expected V sub DDA /sub  analog supply level is available.
The correct analog supply level is indicated by the AVDO bit (PWR_VMSR register) after setting the AVDEN bit (PWR_VMCR register) and selecting the supply level to be monitored 	(ALS bits).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>AVD_READY</name>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>Peripheral analog voltage VDDA not ready (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Peripheral analog voltage VDDA ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETHERNETSO</name>
              <description>ETHERNET RAM shut-off in Stop mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM3SO</name>
              <description>AHB SRAM3 shut-off in Stop mode.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM2_16SO</name>
              <description>AHB SRAM2 16-Kbyte shut-off in Stop mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SRAM2_16SO</name>
                <enumeratedValue>
                  <name>Kept</name>
                  <description>AHB RAM2 content is kept in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Lost</name>
                  <description>AHB RAM2 content is lost in Stop mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM2_48SO</name>
              <description>AHB SRAM2 48-Kbyte shut-off in Stop mode.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM2_16SO"/>
            </field>
            <field>
              <name>SRAM1SO</name>
              <description>AHB SRAM1 shut-off in Stop mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SRAM1SO</name>
                <enumeratedValue>
                  <name>Kept</name>
                  <description>AHB RAM1 content is kept in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Lost</name>
                  <description>AHB RAM1 content is lost in Stop mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PMSR</name>
          <displayName>PMSR</displayName>
          <description>PWR status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STOPF</name>
              <description>Stop flag
This bit is set by hardware and cleared only by any reset or by setting the CSSF bit.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>STOPFR</name>
                <enumeratedValue>
                  <name>NoStopMode</name>
                  <description>System has not been in stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>StopModePreviouslyEntered</name>
                  <description>System has been in Stop mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBF</name>
              <description>System standby flag
This bit is set by hardware and cleared only by a POR or by setting the CSSF bit.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>SBFR</name>
                <enumeratedValue>
                  <name>NoStandbyMode</name>
                  <description>System has not been in standby mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>StandbyModePreviouslyEntered</name>
                  <description>System has been in Standby mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VOSCR</name>
          <displayName>VOSCR</displayName>
          <description>PWR voltage scaling control register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VOS</name>
              <description>voltage scaling selection according to performance
These bits control the V sub CORE /sub  voltage level and allow to obtain the best trade-off between power consumption and performance:
- In bypass mode, these bits must also be set according to the external provided core voltage level and related performance.
- When increasing the performance, the voltage scaling must be changed before increasing the system frequency.
- When decreasing performance, the system frequency must first be decreased before changing the voltage scaling.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>VOS</name>
                <enumeratedValue>
                  <name>VOS3</name>
                  <description>Scale 3 (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS1</name>
                  <description>Scale 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS2</name>
                  <description>Scale 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS0</name>
                  <description>Scale 0</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VOSSR</name>
          <displayName>VOSSR</displayName>
          <description>PWR voltage scaling status register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000008</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VOSRDY</name>
              <description>Ready bit for V sub CORE /sub  voltage scaling output selection.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>VOSRDYR</name>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>Not ready, voltage level below VOS selected level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Ready, voltage level at or above VOS selected level</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTVOSRDY</name>
              <description>Voltage level ready for currently used VOS</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>ACTVOSRDYR</name>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>VCORE is above or below the current voltage scaling provided by ACTVOS[1:0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>VCORE is equal to the current voltage scaling provided by ACTVOS[1:0]</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTVOS</name>
              <description>voltage output scaling currently applied to V sub CORE /sub 
This field provides the last VOS value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>ACTVOSR</name>
                <enumeratedValue>
                  <name>VOS3</name>
                  <description>VOS3 (lowest power)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS2</name>
                  <description>VOS2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS1</name>
                  <description>VOS1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOS0</name>
                  <description>VOS0 (highest frequency)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BDCR</name>
          <displayName>BDCR</displayName>
          <description>PWR Backup domain control register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BREN</name>
              <description>Backup RAM retention in Standby and V sub BAT /sub  modes
When this bit set, the backup regulator (used to maintain the backup RAM content in Standby and V sub BAT /sub  modes) is enabled.
If BREN is cleared, the backup regulator is switched off. The backup RAM can still be used in 	Run and Stop modes. However its content is lost in Standby and V sub BAT /sub  modes.
If BREN is set, the application must wait till the backup regulator ready flag (BRRDY) is set to indicate that the data written into the SRAM is maintained in Standby and V sub BAT /sub  modes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>BREN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Backup regulator enabled; backup RAM content lost in Standby and VBAT modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Backup regulator disabled; backup RAM content preserved in Standby and VBAT modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MONEN</name>
              <description>Backup domain voltage and temperature monitoring enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>MONEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Backup domain voltage and temperature monitoring disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description> Backup domain voltage and temperature monitoring enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBE</name>
              <description>V sub BAT /sub  charging enable
Note: Reset only by POR,.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>VBE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>VBAT battery charging disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>VBAT battery charging enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBRS</name>
              <description>V sub BAT /sub  charging resistor selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>VBRS</name>
                <enumeratedValue>
                  <name>Charge5k</name>
                  <description>Charge VBAT through a 5 kΩ resistor</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Charge1k5</name>
                  <description>Charge VBAT through a 1.5 kΩ resistor</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBPCR</name>
          <displayName>DBPCR</displayName>
          <description>PWR Backup domain control register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBP</name>
              <description>Disable Backup domain write protection
In reset state, all registers and SRAM in Backup domain are protected against parasitic write 	access. This bit must be set to enable write access to these registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>DBP</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Write access to backup domain disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Write access to backup domain enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
