knieriem/tinygo-stm32-svd/svd/stm32h573.svd
        <register>
          <name>BDSR</name>
          <displayName>BDSR</displayName>
          <description>PWR Backup domain status register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BRRDY</name>
              <description>backup regulator ready
This bit is set by hardware to indicate that the backup regulator is ready.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>BRRDYR</name>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>Backup regulator not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Backup regulator ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBATL</name>
              <description>V sub BAT /sub  level monitoring versus low threshold</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>VBATLR</name>
                <enumeratedValue>
                  <name>AboveThreshold</name>
                  <description>Above low threshold level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThreshold</name>
                  <description>Equal to or below low threshold level</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBATH</name>
              <description>V sub BAT /sub  level monitoring versus high threshold</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>VBATHR</name>
                <enumeratedValue>
                  <name>BelowThreshold</name>
                  <description>Below high threshold level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AboveThreshold</name>
                  <description>Equal to or Above high threshold level</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMPL</name>
              <description>temperature level monitoring versus low threshold</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="VBATLR"/>
            </field>
            <field>
              <name>TEMPH</name>
              <description>temperature level monitoring versus high threshold</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="VBATHR"/>
            </field>
          </fields>
        </register>
        <register>
          <name>UCPDR</name>
          <displayName>UCPDR</displayName>
          <description>PWR USB Type-C power delivery register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UCPD_DBDIS</name>
              <description>USB Type-C and power delivery dead battery disable
After exiting reset, the USB Type-C 'dead battery' behavior is enabled, which may have a pull-down effect on CC1 and CC2 pins. It is recommended to disable it in all case, either to stop this pull-down or to hand over control to the UCPD (which should therefore be initialized before doing the disable).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCPD_STBY</name>
              <description>USB Type-c and Power delivery Standby mode
When set, this bit is used to memorize the UCPD configuration in Standby mode. This bit must be written to 1 just before entering Standby mode when using UCPD, and it must be written to 0 after exiting the standby mode and before writing any UCPD register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCCR</name>
          <displayName>SCCR</displayName>
          <description>PWR supply configuration control register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFF0FF</resetMask>
          <fields>
            <field>
              <name>BYPASS</name>
              <description>power management unit bypass</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <name>BYPASS</name>
                <enumeratedValue>
                  <name>InternalRegulator</name>
                  <description>Power management unit normal operation. Use the internal regulator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bypassed</name>
                  <description>Power management unit bypassed. Use the external power.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDOEN</name>
              <description>LDO enable 
The value is set by hardware when the package uses the LDO regulator.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>LDOENR</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Package does not use LDO regulator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Package uses LDO regulator</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMPSEN</name>
              <description>SMPS enable 
The value is set by hardware when the package uses the SMPS regulator.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMCR</name>
          <displayName>VMCR</displayName>
          <description>PWR voltage monitor control register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PVDE</name>
              <description>PVD enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PVDE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>PVD Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>PVD Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLS</name>
              <description>programmable voltage detector (PVD) level selection
These bits select the voltage threshold detected by the PVD.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PLS</name>
                <enumeratedValue>
                  <name>PvdLevel0</name>
                  <description>PVD level0 (VPVD0 around 1.95 V)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PvdLevel1</name>
                  <description>PVD level1 (VPVD1 around 2.1 V)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PvdLevel2</name>
                  <description>PVD level2 (VPVD2 around 2.25 V)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PvdLevel3</name>
                  <description>PVD level3 (VPVD3 around 2.4 V)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PvdLevel4</name>
                  <description>PVD level4 (VPVD4 around 2.55 V)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PvdLevel5</name>
                  <description>PVD level5 (VPVD5 around 2.7 V)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PvdLevel6</name>
                  <description>PVD level6 (VPVD6 around 2.85 V)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PvdIn</name>
                  <description>PVD_IN pin</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVDEN</name>
              <description>peripheral voltage monitor on V sub DDA /sub  enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>AVDEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Peripheral voltage monitor on VDDA disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Peripheral voltage monitor on VDDA enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALS</name>
              <description>analog voltage detector (AVD) level selection
These bits select the voltage threshold detected by the AVD.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ALS</name>
                <enumeratedValue>
                  <name>AvdLevel0</name>
                  <description>AVD level0 (VAVD0 around 1.7 V)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AvdLevel1</name>
                  <description>AVD level1 (VAVD1 around 2.1 V)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AvdLevel2</name>
                  <description>AVD level2 (VAVD2 around 2.5 V)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AvdLevel3</name>
                  <description>AVD level3 (VAVD3 around 2.8 V)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSCR</name>
          <displayName>USBSCR</displayName>
          <description>PWR USB supply control register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB33DEN</name>
              <description>V sub DDUSB /sub  voltage level detector enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB33SV</name>
              <description>independent USB supply valid
This bit is used to validate the V sub DDUSB /sub  supply for electrical and logical isolation purpose. Setting this bit is mandatory to use the USBFS peripheral. If V sub DDUSB /sub  is not always present in the application, the V sub DDUSB /sub  voltage monitor can be used to determine whether this supply is ready or not.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMSR</name>
          <displayName>VMSR</displayName>
          <description>PWR voltage monitor status register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AVDO</name>
              <description>analog voltage detector output on V sub DDA /sub 
This bit is set and cleared by hardware. It is valid only if AVD on VDDA is enabled by the AVDEN bit.
Note: Since the AVD is disabled in Standby mode, this bit is equal to 0 after standby or reset until the AVDEN bit is set.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>AVDOR</name>
                <enumeratedValue>
                  <name>AboveThreshold</name>
                  <description>VDDA is equal or higher than the AVD threshold selected with the ALS[2:0] bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThreshold</name>
                  <description>VDDA is lower than the AVD threshold selected with the ALS[2:0] bits</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDIO2RDY</name>
              <description>voltage detector output on V sub DDIO2 /sub 
This bit is set and cleared by hardware.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>VDDIO2RDYR</name>
                <enumeratedValue>
                  <name>BelowThreshold</name>
                  <description>VDDIO2 is below the threshold of the VDDIO2 voltage monitor</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AboveThreshold</name>
                  <description>VDDIO2 is equal or above the threshold of the VDDIO2 voltage monitor</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVDO</name>
              <description>programmable voltage detect output
This bit is set and cleared by hardware. It is valid only if the PVD has been enabled by the PVDE bit.
Note: Since the PVD is disabled in Standby mode, this bit is equal to 0 after Standby or reset until the PVDE bit is set.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>PVDOR</name>
                <enumeratedValue>
                  <name>AboveThreshold</name>
                  <description>VDD is equal or higher than the PVD threshold selected through the PLS[2:0] bits.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BelowThreshold</name>
                  <description>VDD is lower than the PVD threshold selected through the PLS[2:0] bits</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB33RDY</name>
              <description>V sub DDUSB /sub  ready</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WUSCR</name>
          <displayName>WUSCR</displayName>
          <description>PWR wakeup status clear register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CWUF1</name>
              <description>clear wakeup pin flag for WUFx
These bits are always read as 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <name>CWUF1W</name>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Writing 1 clears the WUFx wakeup pin flag (bit is cleared to 0 by hardware)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CWUF2</name>
              <description>clear wakeup pin flag for WUFx
These bits are always read as 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues derivedFrom="CWUF1W"/>
            </field>
            <field>
              <name>CWUF3</name>
              <description>clear wakeup pin flag for WUFx
These bits are always read as 0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues derivedFrom="CWUF1W"/>
            </field>
            <field>
              <name>CWUF4</name>
              <description>clear wakeup pin flag for WUFx
These bits are always read as 0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues derivedFrom="CWUF1W"/>
            </field>
            <field>
              <name>CWUF5</name>
              <description>clear wakeup pin flag for WUFx
These bits are always read as 0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues derivedFrom="CWUF1W"/>
            </field>
            <field>
              <name>CWUF6</name>
              <description>clear wakeup pin flag for WUFx
These bits are always read as 0.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues derivedFrom="CWUF1W"/>
            </field>
            <field>
              <name>CWUF7</name>
              <description>clear wakeup pin flag for WUFx
These bits are always read as 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues derivedFrom="CWUF1W"/>
            </field>
            <field>
              <name>CWUF8</name>
              <description>clear wakeup pin flag for WUFx
These bits are always read as 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues derivedFrom="CWUF1W"/>
            </field>
          </fields>
        </register>
