knieriem/tinygo-stm32-svd/svd/stm32h573.svd
        <register>
          <name>WUSR</name>
          <displayName>WUSR</displayName>
          <description>PWR wakeup status register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WUF1</name>
              <description>wakeup pin WUFx flag
This bit is set by hardware and cleared only by a RESET pin or by setting the CWUFx bit in PWR_WUSCR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>WUF1R</name>
                <enumeratedValue>
                  <name>NoEventOccurred</name>
                  <description>No wakeup event occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EventOccurred</name>
                  <description>A wakeup event received from WUFx pin</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF2</name>
              <description>wakeup pin WUFx flag
This bit is set by hardware and cleared only by a RESET pin or by setting the CWUFx bit in PWR_WUSCR register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="WUF1R"/>
            </field>
            <field>
              <name>WUF3</name>
              <description>wakeup pin WUFx flag
This bit is set by hardware and cleared only by a RESET pin or by setting the CWUFx bit in PWR_WUSCR register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="WUF1R"/>
            </field>
            <field>
              <name>WUF4</name>
              <description>wakeup pin WUFx flag
This bit is set by hardware and cleared only by a RESET pin or by setting the CWUFx bit in PWR_WUSCR register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="WUF1R"/>
            </field>
            <field>
              <name>WUF5</name>
              <description>wakeup pin WUFx flag
This bit is set by hardware and cleared only by a RESET pin or by setting the CWUFx bit in PWR_WUSCR register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="WUF1R"/>
            </field>
            <field>
              <name>WUF6</name>
              <description>wakeup pin WUFx flag
This bit is set by hardware and cleared only by a RESET pin or by setting the CWUFx bit in PWR_WUSCR register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="WUF1R"/>
            </field>
            <field>
              <name>WUF7</name>
              <description>wakeup pin WUFx flag
This bit is set by hardware and cleared only by a RESET pin or by setting the CWUFx bit in PWR_WUSCR register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="WUF1R"/>
            </field>
            <field>
              <name>WUF8</name>
              <description>wakeup pin WUFx flag
This bit is set by hardware and cleared only by a RESET pin or by setting the CWUFx bit in PWR_WUSCR register.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="WUF1R"/>
            </field>
          </fields>
        </register>
        <register>
          <name>WUCR</name>
          <displayName>WUCR</displayName>
          <description>PWR wakeup configuration register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WUPEN1</name>
              <description>enable wakeup pin WUPx
These bits are set and cleared by software.
Note: an additional wakeup event is detected if WUPx pin is enabled (by setting the WUPENx bit) when WUPx pin level is already high when WUPPx selects rising edge, or low when WUPPx selects falling edge.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>WUPEN1</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>An event on WUPx pin does not wakeup the system from Standby mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>A rising or falling edge on WUPx pin wakes up the system from Standby mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPEN2</name>
              <description>enable wakeup pin WUPx
These bits are set and cleared by software.
Note: an additional wakeup event is detected if WUPx pin is enabled (by setting the WUPENx bit) when WUPx pin level is already high when WUPPx selects rising edge, or low when WUPPx selects falling edge.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPEN1"/>
            </field>
            <field>
              <name>WUPEN3</name>
              <description>enable wakeup pin WUPx
These bits are set and cleared by software.
Note: an additional wakeup event is detected if WUPx pin is enabled (by setting the WUPENx bit) when WUPx pin level is already high when WUPPx selects rising edge, or low when WUPPx selects falling edge.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPEN1"/>
            </field>
            <field>
              <name>WUPEN4</name>
              <description>enable wakeup pin WUPx
These bits are set and cleared by software.
Note: an additional wakeup event is detected if WUPx pin is enabled (by setting the WUPENx bit) when WUPx pin level is already high when WUPPx selects rising edge, or low when WUPPx selects falling edge.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPEN1"/>
            </field>
            <field>
              <name>WUPEN5</name>
              <description>enable wakeup pin WUPx
These bits are set and cleared by software.
Note: an additional wakeup event is detected if WUPx pin is enabled (by setting the WUPENx bit) when WUPx pin level is already high when WUPPx selects rising edge, or low when WUPPx selects falling edge.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPEN1"/>
            </field>
            <field>
              <name>WUPEN6</name>
              <description>enable wakeup pin WUPx
These bits are set and cleared by software.
Note: an additional wakeup event is detected if WUPx pin is enabled (by setting the WUPENx bit) when WUPx pin level is already high when WUPPx selects rising edge, or low when WUPPx selects falling edge.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPEN1"/>
            </field>
            <field>
              <name>WUPEN7</name>
              <description>enable wakeup pin WUPx
These bits are set and cleared by software.
Note: an additional wakeup event is detected if WUPx pin is enabled (by setting the WUPENx bit) when WUPx pin level is already high when WUPPx selects rising edge, or low when WUPPx selects falling edge.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPEN1"/>
            </field>
            <field>
              <name>WUPEN8</name>
              <description>enable wakeup pin WUPx
These bits are set and cleared by software.
Note: an additional wakeup event is detected if WUPx pin is enabled (by setting the WUPENx bit) when WUPx pin level is already high when WUPPx selects rising edge, or low when WUPPx selects falling edge.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPEN1"/>
            </field>
            <field>
              <name>WUPP1</name>
              <description>wakeup pin polarity bit for WUPx
These bits define the polarity used for event detection on WUPx external wakeup pin.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>WUPP1</name>
                <enumeratedValue>
                  <name>HighLevel</name>
                  <description>Detection on high level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LowLevel</name>
                  <description>Detection on low level</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPP2</name>
              <description>wakeup pin polarity bit for WUPx
These bits define the polarity used for event detection on WUPx external wakeup pin.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPP1"/>
            </field>
            <field>
              <name>WUPP3</name>
              <description>wakeup pin polarity bit for WUPx
These bits define the polarity used for event detection on WUPx external wakeup pin.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPP1"/>
            </field>
            <field>
              <name>WUPP4</name>
              <description>wakeup pin polarity bit for WUPx
These bits define the polarity used for event detection on WUPx external wakeup pin.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPP1"/>
            </field>
            <field>
              <name>WUPP5</name>
              <description>wakeup pin polarity bit for WUPx
These bits define the polarity used for event detection on WUPx external wakeup pin.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPP1"/>
            </field>
            <field>
              <name>WUPP6</name>
              <description>wakeup pin polarity bit for WUPx
These bits define the polarity used for event detection on WUPx external wakeup pin.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPP1"/>
            </field>
            <field>
              <name>WUPP7</name>
              <description>wakeup pin polarity bit for WUPx
These bits define the polarity used for event detection on WUPx external wakeup pin.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPP1"/>
            </field>
            <field>
              <name>WUPP8</name>
              <description>wakeup pin polarity bit for WUPx
These bits define the polarity used for event detection on WUPx external wakeup pin.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPP1"/>
            </field>
            <field>
              <name>WUPPUPD1</name>
              <description>wakeup pin pull configuration for WKUPx
These bits define the I/O pad pull configuration used when WUPENx = 1. The associated GPIO port pull configuration must be set to the same value or to 00. The wakeup pin pull configuration is kept in Standby mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>WUPPUPD1</name>
                <enumeratedValue>
                  <name>NoPull</name>
                  <description>No pull-up or pull-down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PullUp</name>
                  <description>Pull-up</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PullDown</name>
                  <description>Pull-down</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPPUPD2</name>
              <description>wakeup pin pull configuration for WKUPx
These bits define the I/O pad pull configuration used when WUPENx = 1. The associated GPIO port pull configuration must be set to the same value or to 00. The wakeup pin pull configuration is kept in Standby mode.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPPUPD1"/>
            </field>
            <field>
              <name>WUPPUPD3</name>
              <description>wakeup pin pull configuration for WKUPx
These bits define the I/O pad pull configuration used when WUPENx = 1. The associated GPIO port pull configuration must be set to the same value or to 00. The wakeup pin pull configuration is kept in Standby mode.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPPUPD1"/>
            </field>
            <field>
              <name>WUPPUPD4</name>
              <description>wakeup pin pull configuration for WKUPx
These bits define the I/O pad pull configuration used when WUPENx = 1. The associated GPIO port pull configuration must be set to the same value or to 00. The wakeup pin pull configuration is kept in Standby mode.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPPUPD1"/>
            </field>
            <field>
              <name>WUPPUPD5</name>
              <description>wakeup pin pull configuration for WKUPx
These bits define the I/O pad pull configuration used when WUPENx = 1. The associated GPIO port pull configuration must be set to the same value or to 00. The wakeup pin pull configuration is kept in Standby mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPPUPD1"/>
            </field>
            <field>
              <name>WUPPUPD6</name>
              <description>wakeup pin pull configuration for WKUPx
These bits define the I/O pad pull configuration used when WUPENx = 1. The associated GPIO port pull configuration must be set to the same value or to 00. The wakeup pin pull configuration is kept in Standby mode.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPPUPD1"/>
            </field>
            <field>
              <name>WUPPUPD7</name>
              <description>wakeup pin pull configuration for WKUPx
These bits define the I/O pad pull configuration used when WUPENx = 1. The associated GPIO port pull configuration must be set to the same value or to 00. The wakeup pin pull configuration is kept in Standby mode.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPPUPD1"/>
            </field>
            <field>
              <name>WUPPUPD8</name>
              <description>wakeup pin pull configuration for WKUPx
These bits define the I/O pad pull configuration used when WUPENx = 1. The associated GPIO port pull configuration must be set to the same value or to 00. The wakeup pin pull configuration is kept in Standby mode.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPPUPD1"/>
            </field>
          </fields>
        </register>
        <register>
          <name>IORETR</name>
          <displayName>IORETR</displayName>
          <description>PWR I/O retention register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IORETEN</name>
              <description>IO retention enable:
When entering into standby mode, the output is sampled, and apply to the output IO during the standby power mode. 
Note: the IO state is not retained if the DBG_STANDBY bit is set in DBGMCU_CR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>IORETEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>IO Retention mode is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description> IO Retention mode is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JTAGIORETEN</name>
              <description>IO retention enable for JTAG IOs
when entering into standby mode, the output is sampled, and apply to the output IO during the standby power mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>JTAGIORETEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>IO Retention mode is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description> IO Retention mode is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
