knieriem/tinygo-stm32-svd/svd/stm32h573.svd
        <register derivedFrom="TIM2.CCMR1_Output">
          <name>CCMR1_Output</name>
          <displayName>CCMR1_Output</displayName>
          <description>TIM5 capture/compare mode register 1 [alternate]</description>
          <alternateRegister>CCMR1_Input</alternateRegister>
          <addressOffset>0x18</addressOffset>
        </register>
        <register derivedFrom="TIM2.CCMR2_Input">
          <name>CCMR2_Input</name>
          <displayName>CCMR2_Input</displayName>
          <description>TIM5 capture/compare mode register 2 [alternate]</description>
          <addressOffset>0x1C</addressOffset>
        </register>
        <register derivedFrom="TIM2.CCMR2_Output">
          <name>CCMR2_Output</name>
          <displayName>CCMR2_Output</displayName>
          <description>TIM5 capture/compare mode register 2 [alternate]</description>
          <alternateRegister>CCMR2_Input</alternateRegister>
          <addressOffset>0x1C</addressOffset>
        </register>
        <register derivedFrom="TIM2.CCER">
          <name>CCER</name>
          <displayName>CCER</displayName>
          <description>TIM5 capture/compare enable register</description>
          <addressOffset>0x20</addressOffset>
        </register>
        <register derivedFrom="TIM2.CNT">
          <name>CNT</name>
          <displayName>CNT</displayName>
          <description>TIM5 counter</description>
          <addressOffset>0x24</addressOffset>
        </register>
        <register derivedFrom="TIM2.PSC">
          <name>PSC</name>
          <displayName>PSC</displayName>
          <description>TIM5 prescaler</description>
          <addressOffset>0x28</addressOffset>
        </register>
        <register derivedFrom="TIM2.ARR">
          <name>ARR</name>
          <displayName>ARR</displayName>
          <description>TIM5 auto-reload register</description>
          <addressOffset>0x2C</addressOffset>
        </register>
        <register derivedFrom="TIM2.CCR%s">
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1-4</dimIndex>
          <name>CCR%s</name>
          <displayName>CCR%s</displayName>
          <description>capture/compare register</description>
          <addressOffset>0x34</addressOffset>
        </register>
        <register derivedFrom="TIM2.ECR">
          <name>ECR</name>
          <displayName>ECR</displayName>
          <description>TIM5 timer encoder control register</description>
          <addressOffset>0x58</addressOffset>
        </register>
        <register>
          <name>TISEL</name>
          <displayName>TISEL</displayName>
          <description>TIM5 timer input selection register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TI1SEL</name>
              <description>Selects tim_ti1[0..15] input
...
Refer to  for product specific implementation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>TI1SEL</name>
                <enumeratedValue>
                  <name>Selected</name>
                  <description>TIM1_CHx input selected</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TI2SEL</name>
              <description>Selects tim_ti2[0..15] input
...
Refer to  for product specific implementation.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TI1SEL"/>
            </field>
            <field>
              <name>TI3SEL</name>
              <description>Selects tim_ti3[0..15] input
...
Refer to  for product specific implementation.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TI1SEL"/>
            </field>
            <field>
              <name>TI4SEL</name>
              <description>Selects tim_ti4[0..15] input
...
Refer to  for product specific implementation.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TI1SEL"/>
            </field>
          </fields>
        </register>
        <register>
          <name>AF1</name>
          <displayName>AF1</displayName>
          <description>TIM5 alternate function register 1</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ETRSEL</name>
              <description>etr_in source selection
These bits select the etr_in input source.
...
Refer to  for product specific implementation.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ETRSEL</name>
                <enumeratedValue>
                  <name>Legacy</name>
                  <description>ETR legacy mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP1</name>
                  <description>COMP1 output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP2</name>
                  <description>COMP2 output</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AF2</name>
          <displayName>AF2</displayName>
          <description>TIM5 alternate function register 2</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OCRSEL</name>
              <description>ocref_clr source selection
These bits select the ocref_clr input source.
...
Refer to  for product specific implementation.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register derivedFrom="TIM2.DCR">
          <name>DCR</name>
          <displayName>DCR</displayName>
          <description>TIM5 DMA control register</description>
          <addressOffset>0x3DC</addressOffset>
        </register>
