knieriem/tinygo-stm32-svd/svd/stm32h573.svd
        <register>
          <name>M2WPR2</name>
          <displayName>M2WPR2</displayName>
          <description>RAMCFG memory 2 write protection register 2</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>P32WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P33WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P34WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P35WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P36WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P37WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P38WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P39WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P40WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P41WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P42WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P43WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P44WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P45WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P46WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P47WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P48WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P49WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P50WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P51WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P52WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P53WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P54WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P55WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P56WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P57WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P58WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P59WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P60WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P61WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P62WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P63WP</name>
              <description>SRAM2 1-Kbyte page y write protection
These bits are set by software and cleared only by a global RAMCFG reset.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M2ECCKEYR</name>
          <displayName>M2ECCKEYR</displayName>
          <description>RAMCFG memory 2 ECC key register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ECCKEY</name>
              <description>ECC write protection key
The following steps are required to unlock the write protection of the ECCE bit in the RAMCFG_MxCR register.
1) Write 0xAE into ECCKEY[7:0].
2) Write 0x75 into ECCKEY[7:0].
Note: Writing a wrong key reactivates the write protection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M2ERKEYR</name>
          <displayName>M2ERKEYR</displayName>
          <description>RAMCFG memory 2 erase key register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERASEKEY</name>
              <description>Erase write protection key
The following steps are required to unlock the write protection of the SRAMER bit in the RAMCFG_MxCR register.
1) Write 0xCA into ERASEKEY[7:0].
2) Write 0x53 into ERASEKEY[7:0].
Note: Writing a wrong key reactivates the write protection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M3CR</name>
          <displayName>M3CR</displayName>
          <description>RAMCFG memory 3 control register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFF0</resetMask>
          <fields>
            <field>
              <name>ECCE</name>
              <description>ECC enable.
This bit reset value is defined by the user option bit configuration. When set, it can be cleared by software only after writing the unlock sequence in the RAMCFG_MxECCKEYR register.
Note: This bit is reserved and must be kept at reset value in SRAM1 control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALE</name>
              <description>Address latch enable
Note: This bit is reserved and must be kept at reset value in SRAM1 control register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAMER</name>
              <description>SRAM erase
This bit can be set by software only after writing the unlock sequence in the ERASEKEY field of the RAMCFG_MxERKEYR register. Setting this bit starts the SRAM erase. This bit is automatically cleared by hardware at the end of the erase operation.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M3IER</name>
          <displayName>M3IER</displayName>
          <description>RAMCFG memory 3 interrupt enable register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEIE</name>
              <description>ECC single error interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEIE</name>
              <description>ECC double error interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECCNMI</name>
              <description>Double error NMI
This bit is set by software and cleared only by a global RAMCFG reset.
Note: if ECCNMI is set, the RAMCFG maskable interrupt is not generated whatever DEIE bit value.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M3ISR</name>
          <displayName>M3ISR</displayName>
          <description>RAMCFG memory interrupt status register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEDC</name>
              <description>ECC single error detected and corrected
Note: This bit is reserved and must be kept at reset value in SRAM1 interrupt status register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DED</name>
              <description>ECC double error detected
Note: This bit is reserved and must be kept at reset value in SRAM1 interrupt status register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SRAMBUSY</name>
              <description>SRAM busy with erase operation
Note: Depending on the SRAM, the erase operation can be performed due to software request, system reset if the option bit is enabled, tamper detection or readout protection regression. Refer to Table 18: Internal SRAMs features.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M3SEAR</name>
          <displayName>M3SEAR</displayName>
          <description>RAMCFG memory 3 ECC single error address register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ESEA</name>
              <description>ECC single error address
When the ALE bit is set in the RAMCFG_MxCR register, this field is updated with the address corresponding to the ECC single error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M3DEAR</name>
          <displayName>M3DEAR</displayName>
          <description>RAMCFG memory 3 ECC double error address register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDEA</name>
              <description>ECC double error address
When the ALE bit is set in the RAMCFG_MxCR register, this field is updated with the address corresponding to the ECC double error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M3ICR</name>
          <displayName>M3ICR</displayName>
          <description>RAMCFG memory 3 interrupt clear register 3</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSEDC</name>
              <description>Clear ECC single error detected and corrected
Writing 1 to this flag clears the SEDC bit in the RAMCFG_MxISR register. Reading this flag returns the SEDC value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CDED</name>
              <description>Clear ECC double error detected
Writing 1 to this flag clears the DED bit in the RAMCFG_MxISR register. Reading this flag returns the DED value.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M3ECCKEYR</name>
          <displayName>M3ECCKEYR</displayName>
          <description>RAMCFG memory 3 ECC key register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ECCKEY</name>
              <description>ECC write protection key
The following steps are required to unlock the write protection of the ECCE bit in the RAMCFG_MxCR register.
1) Write 0xAE into ECCKEY[7:0].
2) Write 0x75 into ECCKEY[7:0].
Note: Writing a wrong key reactivates the write protection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M3ERKEYR</name>
          <displayName>M3ERKEYR</displayName>
          <description>RAMCFG memory 3 erase key register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERASEKEY</name>
              <description>Erase write protection key
The following steps are required to unlock the write protection of the SRAMER bit in the RAMCFG_MxCR register.
1) Write 0xCA into ERASEKEY[7:0].
2) Write 0x53 into ERASEKEY[7:0].
Note: Writing a wrong key reactivates the write protection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M4ERKEYR</name>
          <displayName>M4ERKEYR</displayName>
          <description>RAMCFG memory 4 erase key register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERASEKEY</name>
              <description>Erase write protection key
The following steps are required to unlock the write protection of the SRAMER bit in the RAMCFG_MxCR register.
1) Write 0xCA into ERASEKEY[7:0].
2) Write 0x53 into ERASEKEY[7:0].
Note: Writing a wrong key reactivates the write protection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
