knieriem/tinygo-stm32-svd/svd/stm32h573.svd
        <register>
          <name>CCIPR1</name>
          <displayName>CCIPR1</displayName>
          <description>RCC kernel clock configuration register</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USART1SEL</name>
              <description>USART1 kernel clock source selection
Set and reset by software.
others: reserved, the kernel clock is disabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>USARTSEL</name>
                <enumeratedValue>
                  <name>PCLK</name>
                  <description>Peripheral bus clock used as selected as clock source (rcc_pclk_x)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2_Q</name>
                  <description>PLL2 Q clock selected as clock source (pll2_q_ck)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3_Q</name>
                  <description>PLL3 Q clock selected as clock source (pll3_q_ck)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI_KER</name>
                  <description>HSI kernel clock selected as clock source (hsi_ker_ck)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI_KER</name>
                  <description>CSI kernel clock selected as clock source (csi_ker_ck)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE clock selected as clock source (lse_ck)</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USART2SEL</name>
              <description>USART2 kernel clock source selection
Set and reset by software.
others: reserved, the kernel clock is disabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="USARTSEL"/>
            </field>
            <field>
              <name>USART3SEL</name>
              <description>USART3 kernel clock source selection
Set and reset by software.
others: reserved, the kernel clock is disabled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="USARTSEL"/>
            </field>
            <field>
              <name>UART4SEL</name>
              <description>UART4 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="USARTSEL"/>
            </field>
            <field>
              <name>UART5SEL</name>
              <description>UART5 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="USARTSEL"/>
            </field>
            <field>
              <name>USART6SEL</name>
              <description>USART6 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="USARTSEL"/>
            </field>
            <field>
              <name>UART7SEL</name>
              <description>UART7 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="USARTSEL"/>
            </field>
            <field>
              <name>UART8SEL</name>
              <description>UART8 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="USARTSEL"/>
            </field>
            <field>
              <name>UART9SEL</name>
              <description>UART9 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="USARTSEL"/>
            </field>
            <field>
              <name>USART10SEL</name>
              <description>USART10 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="USARTSEL"/>
            </field>
            <field>
              <name>TIMICSEL</name>
              <description>TIM12, TIM15 and LPTIM2 input capture source selection
Set and reset by software.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>TIMICSEL</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No internal clock available for timers input capture</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>hsi_ker_ck/1024, hsi_ker_ck/8 and csi_ker_ck/128 selected for timers input capture</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR2</name>
          <displayName>CCIPR2</displayName>
          <description>RCC kernel clock configuration register</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field derivedFrom="RCC.CCIPR1.USART1SEL">
              <name>USART11SEL</name>
              <description>USART11 kernel clock source selection
Set and reset by software.
others: reserved, the kernel clock is disabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field derivedFrom="RCC.CCIPR1.USART1SEL">
              <name>UART12SEL</name>
              <description>USART12 kernel clock source selection
Set and reset by software.
others: reserved, the kernel clock is disabled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPTIM1SEL</name>
              <description>LPTIM1 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>LPTIMSEL</name>
                <enumeratedValue>
                  <name>PCLK</name>
                  <description>Peripheral bus clock used as selected as clock source (rcc_pclk_x)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2_P</name>
                  <description>PLL2 P clock selected as clock source (pll2_p_ck)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3_R</name>
                  <description>PLL3 R clock selected as clock source (pll3_r_ck)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE_KER</name>
                  <description>LSE kernel selected as clock source (lse_ck)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSI_KER</name>
                  <description>LSI kernel selected as clock source (lsi_ker_ck)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_CK</name>
                  <description>per_ck clock selected as clock source</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPTIM2SEL</name>
              <description>LPTIM2 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="LPTIMSEL"/>
            </field>
            <field>
              <name>LPTIM3SEL</name>
              <description>LPTIM3 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="LPTIMSEL"/>
            </field>
            <field>
              <name>LPTIM4SEL</name>
              <description>LPTIM4 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="LPTIMSEL"/>
            </field>
            <field>
              <name>LPTIM5SEL</name>
              <description>LPTIM5 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="LPTIMSEL"/>
            </field>
            <field>
              <name>LPTIM6SEL</name>
              <description>LPTIM6 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="LPTIMSEL"/>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR3</name>
          <displayName>CCIPR3</displayName>
          <description>RCC kernel clock configuration register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPI1SEL</name>
              <description>SPI1 kernel clock source selection
Set and reset by software.
others: reserved, the kernel clock is disabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SPI123SEL</name>
                <enumeratedValue>
                  <name>PLL1_Q</name>
                  <description>PLL1 Q clock selected as clock source (pll1_q_ck)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2_P</name>
                  <description>PLL2 P clock selected as clock source (pll2_p_ck)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3_P</name>
                  <description>PLL3 P clock selected as clock source (pll3_p_ck)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUDIOCLK</name>
                  <description>AUDIOCLK clock selected as clock source</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_CK</name>
                  <description>per_ck clock selected as clock source</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI2SEL</name>
              <description>SPI2 kernel clock source selection
Set and reset by software.
others: reserved, the kernel clock is disabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI123SEL"/>
            </field>
            <field>
              <name>SPI3SEL</name>
              <description>SPI3 kernel clock source selection
Set and reset by software.
others: reserved, the kernel clock is disabled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI123SEL"/>
            </field>
            <field>
              <name>SPI4SEL</name>
              <description>SPI4 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SPI456SEL</name>
                <enumeratedValue>
                  <name>PCLK</name>
                  <description>Peripheral bus clock used as selected as clock source (rcc_pclk_x)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2_Q</name>
                  <description>PLL2 Q clock selected as clock source (pll2_p_ck)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3_Q</name>
                  <description>PLL3 Q clock selected as clock source (pll3_p_ck)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI_KER</name>
                  <description>HSI kernel clock selected as clock source (hsi_ker_ck)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI_KER</name>
                  <description>CSI kernel clock selected as clock source (csi_ker_ck)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE clock selected as clock source (hse_ck)</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI5SEL</name>
              <description>SPI5 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI456SEL"/>
            </field>
            <field>
              <name>SPI6SEL</name>
              <description>SPI6 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI456SEL"/>
            </field>
            <field derivedFrom="RCC.CCIPR1.USART1SEL">
              <name>LPUART1SEL</name>
              <description>LPUART1 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
