knieriem/tinygo-stm32-svd/svd/stm32h573.svd
        <register>
          <name>CCIPR4</name>
          <displayName>CCIPR4</displayName>
          <description>RCC kernel clock configuration register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OCTOSPI1SEL</name>
              <description>OCTOSPI1 kernel clock source selection
Set and reset by software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>OCTOSPI1SEL</name>
                <enumeratedValue>
                  <name>RCC_HCLK4</name>
                  <description>HCLK4 selected as clock source (rcc_hclk4)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1_Q</name>
                  <description>PLL1 Q clock selected as clock source (pll1_q_ck)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2_R</name>
                  <description>PLL2 R clock selected as clock source (pll2_r_ck)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_CK</name>
                  <description>per_ck clock selected as clock source</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSTICKSEL</name>
              <description>SYSTICK clock source selection
Note: rcc_hclk frequency must be four times higher than
lsi_ker_ck/lse_ck (period (LSI/LSE) greater than or equal 4 * period (HCLK).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SYSTICKSEL</name>
                <enumeratedValue>
                  <name>HCLK_DIV8</name>
                  <description>RCC HLCK divided by 8 selected as clock source (rcc_hclk / 8)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSI_KER</name>
                  <description>LSI kernel selected as clock source (lsi_ker_ck)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE selected as clock source (lse_ck)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBSEL</name>
              <description>USB kernel clock source selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>USBSEL</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1_Q</name>
                  <description>PLL1 Q clock selected as clock source (pll1_q_ck)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3_Q</name>
                  <description>PLL3 Q clock selected as clock source (pll3_q_ck)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI48</name>
                  <description>HSI48 clock selected as clock source (hsi48_ker_ck)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDMMC1SEL</name>
              <description>SDMMC1 kernel clock source selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SDMMCSEL</name>
                <enumeratedValue>
                  <name>PLL1_Q</name>
                  <description>PLL1 Q clock selected as clock source (pll1_q_ck)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2_R</name>
                  <description>PLL2 R clock selected as clock source (pll2_r_ck)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDMMC2SEL</name>
              <description>SDMMC2 kernel clock source selection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SDMMCSEL"/>
            </field>
            <field>
              <name>I2C1SEL</name>
              <description>I2C1 kernel clock source selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>I2CSEL</name>
                <enumeratedValue>
                  <name>PCLK</name>
                  <description>Peripheral bus clock used as selected as clock source (rcc_pclk_x)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3_R</name>
                  <description>PLL3 R Clock selected as clock source (pll3_r_ck)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI_KER</name>
                  <description>HSI kernel clock selected as clock source (hsi_ker_ck)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI_KER</name>
                  <description>CSI kernel clock selected as clock source (csi_ker_ck)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C2SEL</name>
              <description>I2C2 kernel clock source selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="I2CSEL"/>
            </field>
            <field>
              <name>I2C3SEL</name>
              <description>I2C3 kernel clock source selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="I2CSEL"/>
            </field>
            <field>
              <name>I2C4SEL</name>
              <description>I2C4 kernel clock source selection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="I2CSEL"/>
            </field>
            <field>
              <name>I3C1SEL</name>
              <description>I3C1 kernel clock source selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>I3CSEL</name>
                <enumeratedValue>
                  <name>PCLK</name>
                  <description>Peripheral bus clock used as selected as clock source (rcc_pclk_x)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3_R</name>
                  <description>PLL3 R clock selected as clock source (pll3_r_ck)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI_KER</name>
                  <description>HSI kernel clock selected as clock source (hsi_ker_ck)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I3C2SEL</name>
              <description>I3C2 kernel clock source selection</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="I3CSEL"/>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR5</name>
          <displayName>CCIPR5</displayName>
          <description>RCC kernel clock configuration register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCDACSEL</name>
              <description>ADC and DAC kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ADCDACSEL</name>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>HLCK clock selected as clock source (rcc_hclk)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYS</name>
                  <description>System clock selected as pclock source (sys_ck)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2_R</name>
                  <description>PLL2 R clock selected as clock source (pll2_r_ck)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE clock selected as clock source (hse_ck)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI_KER</name>
                  <description>HSI kernel clock selected as clock source (hsi_ker_ck)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI_KER</name>
                  <description>CSI kernel clock selected as clock source (csi_ker_ck)</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DACSEL</name>
              <description>DAC hold clock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>DACSEL</name>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE selected as clock source (lse_ck)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSI_KER</name>
                  <description>LSI kernel selected as clock source (lsi_ker_ck)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNGSEL</name>
              <description>RNG kernel clock source selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>RNGSEL</name>
                <enumeratedValue>
                  <name>HSI48_KER</name>
                  <description>HSI48 kernel clock selected as clock source (hsi48_ker_ck)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1_Q</name>
                  <description>PLL1 Q clock selected as clock source (pll1_q_ck)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE clock selected as clock source (lse_ck)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSI</name>
                  <description>LSI kernel clock selected as clock source (lsi_ker_ck)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CECSEL</name>
              <description>HSMI-CEC kernel clock source selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>CECSEL</name>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE selected as clock source (lse_ck)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSI_KER</name>
                  <description>LSI kernel selected as clock source (lsi_ker_ck)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI_KER</name>
                  <description>CSI kernel clock divided by 122 selected as clock source (csi_ker_ck/122)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDCANSEL</name>
              <description>FDCAN kernel clock source selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>FDCANSEL</name>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE clock selected as clock source (hse_ck)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1_Q</name>
                  <description>PLL1 Q clock selected as clock source (pll1_q_ck)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2_Q</name>
                  <description>PLL2 Q clock selected as clock source (pll2_q_ck)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1SEL</name>
              <description>SAI1 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SAISEL</name>
                <enumeratedValue>
                  <name>PLL1_Q</name>
                  <description>PLL1 Q clock selected as clock source (pll1_q_ck)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2_P</name>
                  <description>PLL2 P clock selected as clock source (pll2_p_ck)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3_P</name>
                  <description>PLL3 P clock selected as clock source (pll3_p_ck)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUDIOCLK</name>
                  <description>AUDIOCLK clock selected as clock source</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_CK</name>
                  <description>per_ck clock selected as clock source</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI2SEL</name>
              <description>SAI2 kernel clock source selection
others: reserved, the kernel clock is disabled</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SAISEL"/>
            </field>
            <field>
              <name>CKPERSEL</name>
              <description>per_ck clock source selection</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>CKPERSEL</name>
                <enumeratedValue>
                  <name>HSI_KER</name>
                  <description>HSI kernel clock selected as clock source (hsi_ker_ck)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI_KER</name>
                  <description>CSI kernel clock selected as clock source (csi_ker_ck)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE clock selected as clock source (hse_ck)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
